
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章 编译 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch2.html" />
    
    
    <link rel="prev" href="ch0.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    操作系统思考 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch0.html">
            
                <a href="ch0.html">
            
                    
                    第零章 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 进程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 虚拟内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 文件和文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 更多的位与字节
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 缓存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 多任务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章 线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章 条件变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章 C语言中的信号量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="donors.html">
            
                <a href="donors.html">
            
                    
                    捐赠名单
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章 编译</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7AE0;-&#x7F16;&#x8BD1;">&#x7B2C;&#x4E00;&#x7AE0; &#x7F16;&#x8BD1;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;<a href="http://greenteapress.com/wp/" target="_blank">Allen B. Downey</a></p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://greenteapress.com/thinkos/html/thinkos002.html" target="_blank">Chapter 1  Compilation</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<h2 id="11-&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x548C;&#x89E3;&#x91CA;&#x8BED;&#x8A00;">1.1 &#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x548C;&#x89E3;&#x91CA;&#x8BED;&#x8A00;</h2>
<p>&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x628A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x63CF;&#x8FF0;&#x4E3A;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x6216;&#x8005;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#x3002;&#x524D;&#x8005;&#x7684;&#x610F;&#x601D;&#x662F;&#x7A0B;&#x5E8F;&#x88AB;&#x7FFB;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x8BED;&#x8A00;&#xFF0C;&#x4E4B;&#x540E;&#x7531;&#x786C;&#x4EF6;&#x6267;&#x884C;&#xFF1B;&#x800C;&#x540E;&#x8005;&#x7684;&#x610F;&#x601D;&#x662F;&#x7A0B;&#x5E8F;&#x88AB;&#x8F6F;&#x4EF6;&#x89E3;&#x91CA;&#x5668;&#x8BFB;&#x53D6;&#x5E76;&#x6267;&#x884C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;C&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#xFF0C;&#x800C;Python&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#x3002;&#x4F46;&#x662F;&#x4E8C;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x754C;&#x9650;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x90A3;&#x4E48;&#x660E;&#x663E;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x65E2;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x4E5F;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B58;&#x5728;C&#x7684;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x548C;Python&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x7C7B;&#x4F3C;Java&#x7684;&#x8BED;&#x8A00;&#x6DF7;&#x5408;&#x4E86;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5148;&#x628A;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x6210;&#x4E2D;&#x95F4;&#x8BED;&#x8A00;&#xFF0C;&#x4E4B;&#x540E;&#x5728;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x6267;&#x884C;&#x8F6C;&#x6362;&#x540E;&#x7684;&#x7A0B;&#x5E8F;&#x3002;Java&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x505A;&#x201C;Java &#x5B57;&#x8282;&#x7801;&#x201D;&#x7684;&#x4E2D;&#x95F4;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x7C7B;&#x4F3C;&#x4E8E;&#x673A;&#x5668;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x8F6F;&#x4EF6;&#x89E3;&#x91CA;&#x5668;&#x6267;&#x884C;&#xFF0C;&#x5373;Java&#x865A;&#x62DF;&#x673A;&#xFF08;JVM&#xFF09;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x6216;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x5E76;&#x4E0D;&#x662F;&#x8BED;&#x8A00;&#x7684;&#x5185;&#x5728;&#x7279;&#x5F81;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x548C;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x4E9B;&#x666E;&#x904D;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<h2 id="12-&#x9759;&#x6001;&#x7C7B;&#x578B;">1.2 &#x9759;&#x6001;&#x7C7B;&#x578B;</h2>
<p>&#x8BB8;&#x591A;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#x90FD;&#x652F;&#x6301;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x901A;&#x5E38;&#x9650;&#x5236;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x7A0B;&#x5E8F;&#xFF0C;&#x6765;&#x5206;&#x8FA8;&#x51FA;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x90FD;&#x6307;&#x5411;&#x54EA;&#x79CD;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x77E5;&#x9053;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x201C;&#x9759;&#x6001;&#x201D;&#x6307;&#x90A3;&#x4E9B;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x201C;&#x52A8;&#x6001;&#x201D;&#x6307;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;Python&#x4E2D;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x7F16;&#x5199;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">add</span><span class="hljs-params">(x, y)</span>:</span>
    <span class="hljs-keyword">return</span> x + y
</code></pre>
<p>&#x89C2;&#x5BDF;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5206;&#x8FA8;&#x51FA;<code>x</code>&#x548C;<code>y</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x8C03;&#x7528;&#x6570;&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x63A5;&#x53D7;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;&#x4EFB;&#x4F55;&#x652F;&#x6301;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x7684;&#x503C;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x90FD;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF0C;&#x6216;&#x8005;&#x201C;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x201D;&#x3002;</p>
<p>C&#x4E2D;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x7F16;&#x5199;&#x540C;&#x6837;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">add</span><span class="hljs-params">(<span class="hljs-keyword">int</span> x, <span class="hljs-keyword">int</span> y)</span> </span>{
    <span class="hljs-keyword">return</span> x + y;
}
</code></pre>
<p>&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x5305;&#x542B;&#x4E86;&#x53C2;&#x6570;&#x53CA;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x201C;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x201D;&#xFF1A;<code>x</code>&#x548C;<code>y</code>&#x90FD;&#x58F0;&#x660E;&#x4E3A;&#x6574;&#x6570;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x68C0;&#x67E5;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x5BF9;&#x8BE5;&#x7C7B;&#x578B;&#x662F;&#x5426;&#x5408;&#x6CD5;&#xFF08;&#x662F;&#x7684;&#xFF09;&#x3002;&#x8FD4;&#x56DE;&#x503C;&#x4E5F;&#x58F0;&#x660E;&#x4E3A;&#x6574;&#x6570;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#xFF0C;&#x5F53;&#x51FD;&#x6570;&#x5728;&#x7A0B;&#x5E8F;&#x5176;&#x5B83;&#x4F4D;&#x7F6E;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x53C2;&#x6570;&#x662F;&#x5426;&#x5177;&#x6709;&#x6B63;&#x786E;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#x5728;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x66F4;&#x5FEB;&#x5730;&#x627E;&#x5230;&#x9519;&#x8BEF;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x7A0B;&#x5E8F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x9519;&#x8BEF;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#x4E0D;&#x5FC5;&#x53D1;&#x751F;&#x4E8E;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x901A;&#x5E38;&#x5FEB;&#x4E8E;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x7F16;&#x8BD1;&#x65F6;&#x7684;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x4E5F;&#x4F1A;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#x3002;&#x5728;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x50A8;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x53EF;&#x7531;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;Python&#x4E2D;&#xFF0C;&#x5185;&#x5EFA;&#x7684;<code>locals</code>&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x542B;&#x6709;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x548C;&#x503C;&#x7684;&#x5B57;&#x5178;&#x3002;&#x4E0B;&#x9762;&#x662F;Python&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>x = <span class="hljs-number">5</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">print</span> locals()
{<span class="hljs-string">&apos;x&apos;</span>: <span class="hljs-number">5</span>, <span class="hljs-string">&apos;__builtins__&apos;</span>: &lt;module <span class="hljs-string">&apos;__builtin__&apos;</span> (built-<span class="hljs-keyword">in</span>)&gt;,
<span class="hljs-string">&apos;__name__&apos;</span>: <span class="hljs-string">&apos;__main__&apos;</span>, <span class="hljs-string">&apos;__doc__&apos;</span>: <span class="hljs-keyword">None</span>, <span class="hljs-string">&apos;__package__&apos;</span>: <span class="hljs-keyword">None</span>}
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x8868;&#x660E;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x50A8;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF08;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x503C;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x53EA;&#x5B58;&#x5728;&#x4E8E;&#x7F16;&#x8BD1;&#x65F6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x4E3A;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x4F4D;&#x7F6E;&#x4F5C;&#x4E3A;&#x6240;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;[1]&#x3002;&#x53D8;&#x91CF;&#x7684;&#x4F4D;&#x7F6E;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x5730;&#x5740;&#x201D;&#x3002;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x90FD;&#x50A8;&#x5B58;&#x5728;&#x5B83;&#x7684;&#x5730;&#x5740;&#x5904;&#xFF0C;&#x4F46;&#x662F;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x5B8C;&#x5168;&#x4E0D;&#x4F1A;&#x50A8;&#x5B58;&#xFF08;&#x9664;&#x975E;&#x5B83;&#x4EEC;&#x7531;&#x4E8E;&#x8C03;&#x8BD5;&#x76EE;&#x7684;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x6DFB;&#x52A0;&#xFF09;&#x3002;</p>
<blockquote>
<p>[1] &#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x8FF0;&#xFF0C;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x3002;</p>
</blockquote>
<h2 id="13-&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;">1.3 &#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;</h2>
<p>&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5BF9;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x6709;&#x6240;&#x8BA4;&#x8BC6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x4F1A;&#x5E2E;&#x52A9;&#x4F60;&#x89E3;&#x91CA;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x8C03;&#x8BD5;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x53CA;&#x907F;&#x514D;&#x5E38;&#x89C1;&#x7684;&#x9677;&#x9631;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x7F16;&#x8BD1;&#x7684;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li>&#x9884;&#x5904;&#x7406;&#xFF1A;C&#x662F;&#x5305;&#x542B;&#x201C;&#x9884;&#x5904;&#x7406;&#x6307;&#x4EE4;&#x201D;&#x7684;&#x51E0;&#x79CD;&#x8BED;&#x8A00;&#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x751F;&#x6548;&#x4E8E;&#x7F16;&#x8BD1;&#x4E4B;&#x524D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>#include</code>&#x6307;&#x4EE4;&#x4F7F;&#x5176;&#x5B83;&#x6587;&#x4EF6;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x63D2;&#x5165;&#x5230;&#x6307;&#x4EE4;&#x6240;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</li>
<li>&#x89E3;&#x6790;&#xFF1A;&#x5728;&#x89E3;&#x6790;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x8BFB;&#x53D6;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x6784;&#x5EFA;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x201D;&#xFF08;AST&#xFF09;&#x3002;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x9519;&#x8BEF;&#x68C0;&#x6D4B;&#x901A;&#x5E38;&#x4E3A;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x9759;&#x6001;&#x68C0;&#x67E5;&#xFF1A;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x68C0;&#x67E5;&#x53D8;&#x91CF;&#x548C;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x5426;&#x6B63;&#x786E;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x662F;&#x5426;&#x5E26;&#x6709;&#x6B63;&#x786E;&#x6570;&#x91CF;&#x548C;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x3002;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x9519;&#x8BEF;&#x68C0;&#x6D4B;&#x901A;&#x5E38;&#x4E3A;&#x4E00;&#x4E9B;&#x201C;&#x9759;&#x6001;&#x8BED;&#x4E49;&#x201D;&#x7684;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x4EE3;&#x7801;&#x751F;&#x6210;&#xFF1A;&#x7F16;&#x8BD1;&#x5668;&#x8BFB;&#x53D6;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x751F;&#x6210;&#x673A;&#x5668;&#x7801;&#x6216;&#x5B57;&#x8282;&#x7801;&#x3002;</li>
<li>&#x94FE;&#x63A5;&#xFF1A;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E86;&#x5B9A;&#x4E49;&#x5728;&#x5E93;&#x4E2D;&#x7684;&#x503C;&#x6216;&#x51FD;&#x6570;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x9700;&#x8981;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x5E93;&#x5E76;&#x5305;&#x542B;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x3002;</li>
<li>&#x4F18;&#x5316;&#xFF1A;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x51E0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x4E0A;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#x6765;&#x751F;&#x6210;&#x8FD0;&#x884C;&#x66F4;&#x5FEB;&#x6216;&#x5360;&#x7528;&#x66F4;&#x5C11;&#x7A7A;&#x95F4;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5927;&#x591A;&#x6570;&#x4F18;&#x5316;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x6765;&#x6D88;&#x9664;&#x660E;&#x663E;&#x7684;&#x6D6A;&#x8D39;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x4E9B;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x6267;&#x884C;&#x590D;&#x6742;&#x7684;&#x5206;&#x6790;&#x548C;&#x4FEE;&#x6539;&#x3002;</li>
</ol>
<p>&#x901A;&#x5E38;&#x5F53;&#x4F60;&#x8FD0;&#x884C;<code>gcc</code>&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x6267;&#x884C;&#x4E0A;&#x8FF0;&#x6240;&#x6709;&#x6B65;&#x9AA4;&#xFF0C;&#x5E76;&#x4E14;&#x751F;&#x6210;&#x4E00;&#x4EFD;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x7684;C&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span>
</span>{
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;Hello World\n&quot;</span>);
}
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x628A;&#x5B83;&#x4FDD;&#x5B58;&#x5728;&#x540D;&#x4E3A;<code>hello.c</code>&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#xFF1A;</p>
<pre><code class="lang-sh">$ gcc hello.c
$ ./a.out
</code></pre>
<p>&#x901A;&#x5E38;&#xFF0C;<code>gcc</code>&#x5C06;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x50A8;&#x5B58;&#x5728;&#x540D;&#x4E3A;<code>a.out</code>&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF08;&#x5B83;&#x539F;&#x672C;&#x4EE3;&#x8868;&#x6C47;&#x7F16;&#x5668;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5373;&#x201C;assembler output&#x201D;&#xFF09;&#x3002;&#x7B2C;&#x4E8C;&#x884C;&#x8FD0;&#x884C;&#x4E86;&#x8FD9;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;<code>./</code>&#x524D;&#x7F00;&#x544A;&#x8BC9;shell&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x5BFB;&#x627E;&#x5B83;&#x3002;</p>
<p>&#x4F7F;&#x7528;<code>-o</code>&#x9009;&#x9879;&#x6765;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x6CE8;&#x610F;&#x3002;</p>
<pre><code class="lang-sh">$ gcc hello.c -o hello
$ ./hello
</code></pre>
<h2 id="14-&#x76EE;&#x6807;&#x4EE3;&#x7801;">1.4 &#x76EE;&#x6807;&#x4EE3;&#x7801;</h2>
<p><code>-c</code>&#x9009;&#x9879;&#x544A;&#x8BC9;<code>gcc</code>&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x5E76;&#x751F;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x94FE;&#x63A5;&#x5B83;&#x4EEC;&#x6216;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF1A;</p>
<pre><code class="lang-sh">$ gcc hello.c -c
</code></pre>
<p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x662F;&#x540D;&#x4E3A;<code>hello.o</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;<code>o</code>&#x4EE3;&#x8868;&#x201C;&#x76EE;&#x6807;&#x4EE3;&#x7801;&#x201D;&#xFF08;object code&#xFF09;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x76EE;&#x6807;&#x4EE3;&#x7801;&#x5E76;&#x4E0D;&#x662F;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x94FE;&#x63A5;&#x5230;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p><code>nm</code> UNIX&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x5E76;&#x751F;&#x6210;&#x5173;&#x4E8E;&#x5B83;&#x6240;&#x5B9A;&#x4E49;&#x548C;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x540D;&#x79F0;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-sh">$ nm hello.o
0000000000000000 T main
                 U puts
</code></pre>
<p>&#x8F93;&#x51FA;&#x663E;&#x793A;&#xFF0C;<code>hello.o</code>&#x5B9A;&#x4E49;&#x4E86;<code>main</code>&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E86;<code>puts</code>&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x201C;&#x8F93;&#x51FA;&#x5B57;&#x7B26;&#x4E32;&#x201D;&#xFF08;put string&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>gcc</code>&#x901A;&#x8FC7;&#x5C06;<code>printf</code>&#x66FF;&#x6362;&#x6389;&#x6267;&#x884C;&#x4E86;&#x4F18;&#x5316;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x5927;&#x578B;&#x51FD;&#x6570;&#x3002;&#x800C;<code>puts</code>&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-O</code>&#x9009;&#x9879;&#x6765;&#x63A7;&#x5236;<code>gcc</code>&#x4F18;&#x5316;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5B83;&#x6267;&#x884C;&#x975E;&#x5E38;&#x7EC6;&#x5FAE;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x8C03;&#x8BD5;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;<code>-O1</code>&#x9009;&#x9879;&#x4F1A;&#x5F00;&#x542F;&#x6700;&#x4E3A;&#x666E;&#x901A;&#x548C;&#x5B89;&#x5168;&#x7684;&#x4F18;&#x5316;&#x3002;&#x66F4;&#x9AD8;&#x7684;&#x6570;&#x503C;&#x5F00;&#x542F;&#x9700;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x7F16;&#x8BD1;&#x7684;&#x9AD8;&#x7EA7;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x4F18;&#x5316;&#x9664;&#x4E86;&#x52A0;&#x901F;&#x8FD0;&#x884C;&#x4E4B;&#x5916;&#xFF0C;&#x4E0D;&#x5E94;&#x6539;&#x53D8;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x5FAE;&#x5999;&#x7684;bug&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x4F18;&#x5316;&#x4F1A;&#x4F7F;bug&#x51FA;&#x73B0;&#x6216;&#x6D88;&#x5931;&#x3002;&#x5728;&#x5F00;&#x53D1;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5173;&#x95ED;&#x4F18;&#x5316;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x6CE8;&#x610F;&#x3002;&#x4E00;&#x65E6;&#x7A0B;&#x5E8F;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x5E76;&#x901A;&#x8FC7;&#x4E86;&#x9002;&#x5F53;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F00;&#x542F;&#x4F18;&#x5316;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x6D4B;&#x8BD5;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x3002;</p>
<h2 id="15-&#x6C47;&#x7F16;&#x4EE3;&#x7801;">1.5 &#x6C47;&#x7F16;&#x4EE3;&#x7801;</h2>
<p>&#x548C;<code>-c</code>&#x9009;&#x9879;&#x7C7B;&#x4F3C;&#x3002;<code>-S</code>&#x544A;&#x8BC9;<code>gcc</code>&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x5E76;&#x751F;&#x6210;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x4E3A;&#x673A;&#x5668;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x5F62;&#x5F0F;&#x3002;</p>
<pre><code class="lang-sh">$ gcc hello.c -S
</code></pre>
<p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x662F;&#x540D;&#x4E3A;<code>hello.s</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-asm">        .file        &quot;hello.c&quot;
        .section     .rodata
.LC0:
        .string      &quot;Hello World&quot;
        .text
        .globl       main
        .type        main, @function
main:
.LFB0:
        .cfi_startproc
        pushq %rbp
        .cfi_def_cfa_offset 16
        .cfi_offset 6, -16
        movq %rsp, %rbp
        .cfi_def_cfa_register 6
        movl $.LC0, %edi
        call puts
        movl $0, %eax
        popq %rbp
        .cfi_def_cfa 7, 8
        ret
        .cfi_endproc
.LFE0:
        .size        main, .-main
        .ident       &quot;GCC: (Ubuntu/Linaro 4.7.3-1ubuntu1) 4.7.3&quot;
        .section     .note.GNU-stack,&quot;&quot;,@progbits
</code></pre>
<p><code>gcc</code>&#x901A;&#x5E38;&#x4E3A;&#x4F60;&#x6240;&#x8FD0;&#x884C;&#x7684;&#x673A;&#x5668;&#x751F;&#x6210;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x5B83;&#x751F;&#x6210;x86&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF0C;&#x8FD0;&#x884C;&#x5728;Intel&#x3001;AMD&#x548C;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x9762;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD0;&#x884C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x67B6;&#x6784;&#x4E0A;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="16-&#x9884;&#x5904;&#x7406;">1.6 &#x9884;&#x5904;&#x7406;</h2>
<p>&#x5728;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x518D;&#x5F80;&#x524D;&#x9000;&#x4E00;&#x6B65;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-E</code>&#x9009;&#x9879;&#x6765;&#x53EA;&#x8FD0;&#x884C;&#x9884;&#x5904;&#x7406;&#x5668;&#xFF1A;</p>
<pre><code class="lang-sh">$ gcc hello.c -E
</code></pre>
<p>&#x6267;&#x884C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x9884;&#x5904;&#x7406;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5B83;&#x542B;&#x6709;&#x6765;&#x81EA;<code>stdio.h</code>&#x7684;&#x88AB;&#x5305;&#x542B;&#x4EE3;&#x7801;&#xFF0C;&#x548C;<code>stdio.h</code>&#x6240;&#x5305;&#x542B;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x6709;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x6240;&#x5305;&#x542B;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x3002;&#x5728;&#x6211;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x5171;&#x8BA1;800&#x884C;&#x4EE3;&#x7801;&#x3002;&#x56E0;&#x4E3A;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;C&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x90FD;&#x4F1A;&#x5305;&#x542B;<code>stdio.h</code>&#xFF0C;&#x8FD9;800&#x884C;&#x4EE3;&#x7801;&#x7ECF;&#x5E38;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x50CF;&#x5927;&#x591A;&#x6570;C&#x7A0B;&#x5E8F;&#x90A3;&#x6837;&#x4E5F;&#x5305;&#x542B;&#x4E86;<code>stdlib.h</code>&#xFF0C;&#x7ED3;&#x679C;&#x4F1A;&#x53D8;&#x6210;&#x591A;&#x4E8E;1800&#x884C;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="17-&#x7406;&#x89E3;&#x9519;&#x8BEF;">1.7 &#x7406;&#x89E3;&#x9519;&#x8BEF;</h2>
<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x7406;&#x89E3;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x5C31;&#x53D8;&#x5F97;&#x5341;&#x5206;&#x5BB9;&#x6613;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;<code>#include</code>&#x6307;&#x4EE4;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x4F1A;&#x4ECE;&#x9884;&#x5904;&#x7406;&#x5668;&#x5904;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code>hello.c:1:20: fatal error: stdioo.h: No such file or directory
compilation terminated.
</code></pre><p>&#x5982;&#x679C;&#x6709;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x4F1A;&#x4ECE;&#x7F16;&#x8BD1;&#x5668;&#x5904;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code>hello.c: In function &apos;main&apos;:
hello.c:6:1: error: expected &apos;;&apos; before &apos;}&apos; token
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x6CA1;&#x6709;&#x5728;&#x4EFB;&#x4F55;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x4F1A;&#x4ECE;&#x94FE;&#x63A5;&#x5668;&#x5904;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code>/tmp/cc7iAUbN.o: In function `main&apos;:
hello.c:(.text+0xf): undefined reference to `printff&apos;
collect2: error: ld returned 1 exit status
</code></pre><p><code>ld</code>&#x662F;UNIX&#x94FE;&#x63A5;&#x5668;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x8FD9;&#x6837;&#x547D;&#x540D;&#x662F;&#x56E0;&#x4E3A;&#x201C;&#x88C5;&#x8F7D;&#x201D;&#xFF08;loading&#xFF09;&#x662F;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5B83;&#x548C;&#x94FE;&#x63A5;&#x5173;&#x7CFB;&#x5BC6;&#x5207;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#xFF0C;C&#x4F1A;&#x6267;&#x884C;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x68C0;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x6781;&#x5C11;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x751F;&#x4E86;&#x9664;&#x96F6;&#x9519;&#x8BEF;&#xFF0C;&#x6216;&#x8005;&#x6267;&#x884C;&#x4E86;&#x5176;&#x5B83;&#x975E;&#x6CD5;&#x7684;&#x6D6E;&#x70B9;&#x64CD;&#x4F5C;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x201C;&#x6D6E;&#x70B9;&#x6570;&#x5F02;&#x5E38;&#x201D;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5C1D;&#x8BD5;&#x8BFB;&#x5199;&#x5185;&#x5B58;&#x7684;&#x4E0D;&#x6B63;&#x786E;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x201C;&#x6BB5;&#x9519;&#x8BEF;&#x201D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch0.html" class="navigation navigation-prev " aria-label="Previous page: 第零章 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch2.html" class="navigation navigation-next " aria-label="Next page: 第二章 进程">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章 编译","level":"1.3","depth":1,"next":{"title":"第二章 进程","level":"1.4","depth":1,"path":"ch2.md","ref":"ch2.md","articles":[]},"previous":{"title":"第零章 前言","level":"1.2","depth":1,"path":"ch0.md","ref":"ch0.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch1.md","mtime":"2018-01-28T13:50:43.815Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-01-28T13:55:30.349Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

