
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 虚拟内存 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch4.html" />
    
    
    <link rel="prev" href="ch2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    操作系统思考 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch0.html">
            
                <a href="ch0.html">
            
                    
                    第零章 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 进程
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 虚拟内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 文件和文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 更多的位与字节
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 缓存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 多任务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章 线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章 条件变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章 C语言中的信号量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="donors.html">
            
                <a href="donors.html">
            
                    
                    捐赠名单
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三章 虚拟内存</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E09;&#x7AE0;-&#x865A;&#x62DF;&#x5185;&#x5B58;">&#x7B2C;&#x4E09;&#x7AE0; &#x865A;&#x62DF;&#x5185;&#x5B58;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;<a href="http://greenteapress.com/wp/" target="_blank">Allen B. Downey</a></p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://greenteapress.com/thinkos/html/thinkos004.html" target="_blank">Chapter 3  Virtual memory</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<h2 id="31-&#x7B80;&#x660E;&#x4FE1;&#x606F;&#x7406;&#x8BBA;">3.1 &#x7B80;&#x660E;&#x4FE1;&#x606F;&#x7406;&#x8BBA;</h2>
<p>&#x6BD4;&#x7279;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4E5F;&#x662F;&#x4FE1;&#x606F;&#x7684;&#x5355;&#x4F4D;&#x3002;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x6709;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5199;&#x4E3A;0&#x6216;&#x8005;1&#x3002;&#x5982;&#x679C;&#x662F;&#x4E24;&#x4E2A;&#x6BD4;&#x7279;&#xFF0C;&#x90A3;&#x5C31;&#x6709;&#x56DB;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x7EC4;&#x5408;&#xFF0C;00&#x3001;01&#x3001;10&#x548C;11&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;<code>b</code>&#x4E2A;&#x6BD4;&#x7279;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;<code>2 ** b</code>&#x4E2A;&#x503C;&#x4E4B;&#x4E00;&#x3002;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x662F;8&#x4E2A;&#x6BD4;&#x7279;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;256&#x4E2A;&#x503C;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x4ECE;&#x5176;&#x5B83;&#x65B9;&#x9762;&#x6765;&#x8BB2;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x8981;&#x50A8;&#x5B58;&#x5B57;&#x6BCD;&#x8868;&#x4E2D;&#x7684;&#x5B57;&#x6BCD;&#x3002;&#x5B57;&#x6BCD;&#x5171;&#x6709;26&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x9700;&#x8981;&#x591A;&#x5C11;&#x4E2A;&#x6BD4;&#x7279;&#x5462;&#xFF1F;&#x4F7F;&#x7528;4&#x4E2A;&#x6BD4;&#x7279;&#x4F60;&#x53EF;&#x4EE5;&#x8868;&#x793A;16&#x4E2A;&#x503C;&#x4E4B;&#x4E00;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x4F7F;&#x7528;5&#x4E2A;&#x6BD4;&#x7279;&#x4F60;&#x53EF;&#x4EE5;&#x8868;&#x793A;32&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x5B57;&#x6BCD;&#x662F;&#x591F;&#x7528;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x6D6A;&#x8D39;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x8868;&#x793A;<code>N</code>&#x4E2A;&#x503C;&#x4E4B;&#x4E00;&#xFF0C;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x6C42;&#x51FA;&#x6700;&#x5C0F;&#x7684;<code>b</code>&#x4F7F;<code>2 ** b &gt;= N</code>&#x3002;&#x5728;&#x4E24;&#x8FB9;&#x8BA1;&#x7B97;&#x4EE5;2&#x4E3A;&#x5E95;&#x7684;&#x5BF9;&#x6570;&#xFF0C;&#x5C31;&#x4F1A;&#x5F97;&#x5230;<code>b &gt;= log(2, N)</code>&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6211;&#x6295;&#x63B7;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x5E76;&#x4E14;&#x544A;&#x8BC9;&#x4F60;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x5C31;&#x5411;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;1&#x6BD4;&#x7279;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x6211;&#x6295;&#x63B7;&#x516D;&#x4E2A;&#x9762;&#x7684;&#x7B5B;&#x5B50;&#x5E76;&#x544A;&#x8BC9;&#x4F60;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x5C31;&#x5411;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;<code>log(2, 6)</code>&#x6BD4;&#x7279;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x7684;&#x6982;&#x7387;&#x662F;<code>1/n</code>&#xFF0C;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x5305;&#x542B;<code>log(2, N)</code>&#x6BD4;&#x7279;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x7684;&#x6982;&#x7387;&#x4E3A;<code>p</code>&#xFF0C;&#x90A3;&#x4E48;&#x4FE1;&#x606F;&#x7684;&#x5185;&#x5BB9;&#x4E3A;<code>-log(2, p)</code>&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x91CF;&#x53EB;&#x505A;&#x201C;&#x81EA;&#x4FE1;&#x606F;&#x201D;&#xFF08;self-information&#xFF09;&#x3002;&#x5B83;&#x5EA6;&#x91CF;&#x4E86;&#x7ED3;&#x679C;&#x6709;&#x591A;&#x4E48;&#x4EE4;&#x4EBA;&#x610F;&#x5916;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x53EB;&#x4F5C;&#x201C;&#x60CA;&#x5F02;&#x5EA6;&#x201D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8D5B;&#x9A6C;&#x53EA;&#x6709;&#x5341;&#x516D;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x51E0;&#x7387;&#x83B7;&#x80DC;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x83B7;&#x80DC;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x5F97;&#x5230;&#x4E86;4&#x6BD4;&#x7279;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x4EE5;&#x53CA;&#x5956;&#x91D1;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5B83;&#x7684;&#x83B7;&#x80DC;&#x51E0;&#x7387;&#x4E3A;75%&#xFF0C;&#x8FD9;&#x6761;&#x65B0;&#x95FB;&#x53EA;&#x542B;&#x6709;0.42&#x4E2A;&#x6BD4;&#x7279;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x7531;&#x76F4;&#x89C9;&#x5F97;&#x51FA;&#xFF0C;&#x975E;&#x9884;&#x671F;&#x7684;&#x65B0;&#x95FB;&#x4F1A;&#x5E26;&#x6709;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#xFF1B;&#x4E0E;&#x4E4B;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5F88;&#x6709;&#x81EA;&#x4FE1;&#xFF0C;&#x5BF9;&#x5B83;&#x7684;&#x9A8C;&#x8BC1;&#x53EA;&#x4F1A;&#x5F97;&#x5230;&#x5C11;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E66;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x8BDD;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x719F;&#x7EC3;&#x4E8E;&#x5728;&#x6BD4;&#x7279;&#x6570;&#x91CF;<code>b</code>&#x548C;&#x5B83;&#x4EEC;&#x6240;&#x7F16;&#x7801;&#x7684;&#x503C;&#x7684;&#x6570;&#x91CF;<code>N = 2 ** b</code>&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002;</p>
<h2 id="32-&#x5185;&#x5B58;&#xFF08;memory&#xFF09;&#x548C;&#x50A8;&#x5B58;&#x5668;&#xFF08;storage&#xFF09;">3.2 &#x5185;&#x5B58;&#xFF08;Memory&#xFF09;&#x548C;&#x50A8;&#x5B58;&#x5668;&#xFF08;Storage&#xFF09;</h2>
<p>&#x5F53;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x5B83;&#x7684;&#x591A;&#x6570;&#x6570;&#x636E;&#x90FD;&#x653E;&#x5728;&#x201C;&#x4E3B;&#x5B58;&#x201D;&#xFF08;&#x5185;&#x5B58;&#xFF09;&#x4E4B;&#x4E2D;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E9B;&#x968F;&#x673A;&#x50A8;&#x5B58;&#x5668;&#xFF08;RAM&#xFF09;&#x3002;&#x5728;&#x5F53;&#x524D;&#x7684;&#x5927;&#x591A;&#x6570;&#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x4E3B;&#x5B58;&#x975E;&#x5E38;&#x6613;&#x5931;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x7535;&#x8111;&#x5173;&#x95ED;&#x65F6;&#xFF0C;&#x4E3B;&#x5B58;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x6CA1;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x53F0;&#x5F0F;&#x7535;&#x8111;&#x62E5;&#x6709;2~8GiB&#x7684;&#x5185;&#x5B58;&#x3002;GiB&#x4EE3;&#x8868;&#x201C;gibibyte&#x201D;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;<code>2 ** 30</code>&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x4F1A;&#x8BFB;&#x5199;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x901A;&#x5E38;&#x653E;&#x5728;&#x673A;&#x68B0;&#x786C;&#x76D8;&#xFF08;HDD&#xFF09;&#x6216;&#x56FA;&#x6001;&#x786C;&#x76D8;&#xFF08;SSD&#xFF09;&#x91CC;&#x9762;&#x3002;&#x8FD9;&#x4E9B;&#x50A8;&#x5B58;&#x5668;&#x90FD;&#x662F;&#x975E;&#x6613;&#x5931;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x53EF;&#x7528;&#x4E8E;&#x957F;&#x65F6;&#x95F4;&#x50A8;&#x5B58;&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x53F0;&#x5F0F;&#x7535;&#x8111;&#x62E5;&#x6709;500GB&#x5230;2TB&#x7684;HDD&#x3002;GB&#x4EE3;&#x8868;&#x201C;gigabyte&#x201D;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;<code>10 ** 9</code>&#x4E2A;&#x5B57;&#x8282;&#x3002;TB&#x4EE3;&#x8868;&#x201C;terabyte&#x201D;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;<code>10 ** 12</code>&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x5355;&#x4F4D;GiB&#x6765;&#x63CF;&#x8FF0;&#x4E3B;&#x5B58;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5341;&#x8FDB;&#x5236;&#x5355;&#x4F4D;GB&#x548C;TB&#x6765;&#x63CF;&#x8FF0;HDD&#x7684;&#x5927;&#x5C0F;&#x3002;&#x7531;&#x4E8E;&#x5386;&#x53F2;&#x548C;&#x6280;&#x672F;&#x56E0;&#x7D20;&#xFF0C;&#x5185;&#x5B58;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x5355;&#x4F4D;&#x5EA6;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x786C;&#x76D8;&#x4EE5;&#x5341;&#x8FDB;&#x5236;&#x5355;&#x4F4D;&#x5EA6;&#x91CF;&#x3002;&#x672C;&#x4E66;&#x4E2D;&#x6211;&#x4F1A;&#x5C0F;&#x5FC3;&#x533A;&#x5206;&#x4E8C;&#x8FDB;&#x5236;&#x548C;&#x5341;&#x8FDB;&#x5236;&#x5355;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5230;&#x201C;gigabyte&#x201D;&#x4EE5;&#x53CA;GB&#x7F29;&#x5199;&#x901A;&#x5E38;&#x5728;&#x4F7F;&#x7528;&#x4E0A;&#x975E;&#x5E38;&#x6A21;&#x7CCA;&#x3002;</p>
<p>&#x975E;&#x6B63;&#x5F0F;&#x7684;&#x7528;&#x6CD5;&#x4E2D;&#xFF0C;&#x201C;&#x5185;&#x5B58;&#x201D;&#x6709;&#x65F6;&#x4F1A;&#x7528;&#x4E8E;HDD&#x548C;SSD&#xFF08;&#x7279;&#x522B;&#x662F;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;RAM&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x7684;&#x5C5E;&#x6027;&#x5927;&#x76F8;&#x5F84;&#x5EAD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x3002;&#x6211;&#x4F1A;&#x4F7F;&#x7528;&#x201C;&#x50A8;&#x5B58;&#x5668;&#x201D;&#x6765;&#x6307;&#x4EE3;HDD&#x548C;SSD&#x3002;</p>
<h2 id="33-&#x5730;&#x5740;&#x7A7A;&#x95F4;">3.3 &#x5730;&#x5740;&#x7A7A;&#x95F4;</h2>
<p>&#x4E3B;&#x5B58;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x90FD;&#x7531;&#x4E00;&#x4E2A;&#x201C;&#x7269;&#x7406;&#x5730;&#x5740;&#x201D;&#x6574;&#x6570;&#x6240;&#x6307;&#x5B9A;&#xFF0C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x96C6;&#x5408;&#x53EB;&#x505A;&#x7269;&#x7406;&#x201C;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x201D;&#x3002;&#x5B83;&#x7684;&#x8303;&#x56F4;&#x901A;&#x5E38;&#x4E3A;0&#x5230;<code>N-1</code>&#xFF0C;&#x5176;&#x4E2D;<code>N</code>&#x662F;&#x4E3B;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5728;&#x5E26;&#x6709;1GiB&#x4E3B;&#x5B58;&#x7684;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x6700;&#x9AD8;&#x7684;&#x6709;&#x6548;&#x5730;&#x5740;&#x662F;<code>2 ** 30 - 1</code>&#xFF0C;&#x5341;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x4E3A;1,073,741,823&#xFF0C;16&#x8FDB;&#x5236;&#x8868;&#x793A;&#x4E3A;0x03ff ffff&#xFF08;&#x524D;&#x7F00;<code>0x</code>&#x8868;&#x793A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#xFF09;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x8BB8;&#x591A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x201C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x7A0B;&#x5E8F;&#x6C38;&#x8FDC;&#x4E0D;&#x9700;&#x8981;&#x5904;&#x7406;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x7269;&#x7406;&#x5185;&#x5B58;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4EE3;&#x66FF;&#xFF0C;&#x7A0B;&#x5E8F;&#x5904;&#x7406;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x88AB;&#x7F16;&#x7801;&#x4E3A;&#x4ECE;0&#x5230;<code>M-1</code>&#xFF0C;&#x5176;&#x4E2D;<code>M</code>&#x662F;&#x6709;&#x6548;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x6240;&#x5904;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x786C;&#x4EF6;&#x3002;</p>
<p>&#x4F60;&#x4E00;&#x5B9A;&#x542C;&#x8FC7;&#x4EBA;&#x4EEC;&#x8C08;&#x8BBA;32&#x4F4D;&#x548C;64&#x4F4D;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#x8868;&#x660E;&#x4E86;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E5F;&#x901A;&#x5E38;&#x662F;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5728;32&#x4F4D;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x662F;32&#x4F4D;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E3A;&#x4ECE;0&#x5230;0xffff ffff&#x3002;&#x8FD9;&#x4E00;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x662F;<code>2 ** 32</code>&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6216;&#x8005;4GiB&#x3002;</p>
<p>&#x5728;64&#x4F4D;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E3A;<code>2 ** 64</code>&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6216;&#x8005;<code>4 * 1024 ** 6</code>&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x8FD9;&#x662F;16&#x4E2A;EiB&#xFF0C;&#x5927;&#x7EA6;&#x6BD4;&#x5F53;&#x524D;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5927;&#x5341;&#x4EBF;&#x500D;&#x3002;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6BD4;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x8FD9;&#x770B;&#x4E0A;&#x53BB;&#x6709;&#x4E9B;&#x5947;&#x602A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x5B83;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x8BFB;&#x5199;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#x65F6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x5730;&#x5740;&#x3002;&#x786C;&#x4EF6;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#xFF0C;&#x5728;&#x8BBF;&#x95EE;&#x4E3B;&#x5B58;&#x4E4B;&#x524D;&#x5C06;&#x7269;&#x7406;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x6210;&#x865A;&#x62DF;&#x5730;&#x5740;&#x3002;&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#x5728;&#x8FDB;&#x7A0B;&#x5C42;&#x7EA7;&#x4E0A;&#x5B8C;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x4EEC;&#x6240;&#x6620;&#x5C04;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9694;&#x79BB;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x9014;&#x5F84;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x865A;&#x62DF;&#x5730;&#x5740;&#x80FD;&#x6620;&#x5C04;&#x5230;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x3002;</p>
<h2 id="34-&#x5185;&#x5B58;&#x6BB5;">3.4 &#x5185;&#x5B58;&#x6BB5;</h2>
<p>&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x4E2D;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x636E;&#x7EC4;&#x7EC7;&#x4E3A;4&#x4E2A;&#x6BB5;&#xFF1A;</p>
<ul>
<li><code>text</code>&#x6BB5;&#x5305;&#x542B;&#x7A0B;&#x5E8F;&#x6587;&#x672C;&#xFF0C;&#x5373;&#x7A0B;&#x5E8F;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x6307;&#x4EE4;&#x3001;</li>
<li><code>static</code>&#x6BB5;&#x5305;&#x542B;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x6240;&#x5206;&#x914D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5305;&#x62EC;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x548C;&#x4F7F;&#x7528;<code>static</code>&#x58F0;&#x660E;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</li>
<li><code>stack</code>&#x6BB5;&#x5305;&#x542B;&#x8FD0;&#x884C;&#x65F6;&#x6808;&#xFF0C;&#x5B83;&#x7531;&#x6808;&#x5E27;&#x7EC4;&#x6210;&#x3002;&#x6BCF;&#x4E2A;&#x6808;&#x5E27;&#x5305;&#x542B;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3001;&#x672C;&#x5730;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x3002;</li>
<li><code>heap</code>&#x6BB5;&#x5305;&#x542B;&#x8FD0;&#x884C;&#x65F6;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x8C03;&#x7528;C&#x6807;&#x51C6;&#x5E93;&#x51FD;&#x6570;<code>malloc</code>&#x6765;&#x5206;&#x914D;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x6BB5;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x90E8;&#x5206;&#x53D6;&#x51B3;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x90E8;&#x5206;&#x53D6;&#x51B3;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7EC6;&#x8282;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x662F;&#x5171;&#x540C;&#x7684;&#xFF1A;</p>
<ul>
<li><code>text</code>&#x6BB5;&#x9760;&#x8FD1;&#x5185;&#x5B58;&#x201C;&#x5E95;&#x90E8;&#x201D;&#xFF0C;&#x5373;&#x63A5;&#x8FD1;0&#x7684;&#x5730;&#x5740;&#x3002;</li>
<li><code>static</code>&#x6BB5;&#x901A;&#x5E38;&#x521A;&#x597D;&#x5728;<code>text</code>&#x6BB5;&#x4E0A;&#x9762;&#x3002;</li>
<li><code>stack</code>&#x6BB5;&#x9760;&#x8FD1;&#x5185;&#x5B58;&#x9876;&#x90E8;&#xFF0C;&#x5373;&#x63A5;&#x8FD1;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x6700;&#x5927;&#x5730;&#x5740;&#x3002;&#x5728;&#x6269;&#x5F20;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x5411;&#x4F4E;&#x5730;&#x5740;&#x7684;&#x65B9;&#x5411;&#x589E;&#x957F;&#x3002;</li>
<li><code>heap</code>&#x901A;&#x5E38;&#x5728;<code>static</code>&#x6BB5;&#x7684;&#x4E0A;&#x9762;&#x3002;&#x5728;&#x6269;&#x5F20;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x5411;&#x9AD8;&#x5730;&#x5740;&#x7684;&#x65B9;&#x5411;&#x589E;&#x957F;&#x3002;</li>
</ul>
<p>&#x4E3A;&#x4E86;&#x641E;&#x6E05;&#x695A;&#x8FD9;&#x4E9B;&#x6BB5;&#x5728;&#x4F60;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;<code>aspace.c</code>&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;stdlib.h&gt;</span></span>

<span class="hljs-keyword">int</span> global;

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span> <span class="hljs-params">()</span>
</span>{
    <span class="hljs-keyword">int</span> local = <span class="hljs-number">5</span>;
    <span class="hljs-keyword">void</span> *p = <span class="hljs-built_in">malloc</span>(<span class="hljs-number">128</span>);

    <span class="hljs-built_in">printf</span> (<span class="hljs-string">&quot;Address of main is %p\n&quot;</span>, main);
    <span class="hljs-built_in">printf</span> (<span class="hljs-string">&quot;Address of global is %p\n&quot;</span>, &amp;global);
    <span class="hljs-built_in">printf</span> (<span class="hljs-string">&quot;Address of local is %p\n&quot;</span>, &amp;local);
    <span class="hljs-built_in">printf</span> (<span class="hljs-string">&quot;Address of p is %p\n&quot;</span>, p);
}
</code></pre>
<p><code>main</code>&#x662F;&#x51FD;&#x6570;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5F53;&#x5B83;&#x7528;&#x4F5C;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5B83;&#x6307;&#x5411;<code>main</code>&#x4E2D;&#x7B2C;&#x4E00;&#x6761;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5B83;&#x5728;<code>text</code>&#x6BB5;&#x5185;&#x3002;</p>
<p><code>global</code>&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5B83;&#x5728;<code>static</code>&#x6BB5;&#x5185;&#x3002;<code>local</code>&#x662F;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5B83;&#x5728;&#x6808;&#x4E0A;&#x3002;</p>
<p><code>p</code>&#x6301;&#x6709;<code>malloc</code>&#x6240;&#x8FD4;&#x56DE;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x6307;&#x5411;&#x5806;&#x533A;&#x6240;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#x3002;<code>malloc</code>&#x4EE3;&#x8868;&#x201C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x201D;&#xFF08;memory allocate&#xFF09;&#x3002;</p>
<p>&#x683C;&#x5F0F;&#x5316;&#x5360;&#x4F4D;&#x7B26;<code>%p</code>&#x544A;&#x8BC9;<code>printf</code>&#x628A;&#x6BCF;&#x4E2A;&#x5730;&#x5740;&#x683C;&#x5F0F;&#x5316;&#x4E3A;&#x201C;&#x6307;&#x9488;&#x201D;&#xFF0C;&#x5B83;&#x662F;&#x5730;&#x5740;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x8F93;&#x51FA;&#x5C31;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF08;&#x6211;&#x6DFB;&#x52A0;&#x4E86;&#x7A7A;&#x683C;&#x4F7F;&#x5B83;&#x66F4;&#x52A0;&#x6613;&#x8BFB;&#xFF09;&#xFF1A;</p>
<pre><code>Address of main is   0x      40057c
Address of global is 0x      60104c
Address of local is  0x7fffd26139c4
Address of p is      0x     1c3b010
</code></pre><p>&#x6B63;&#x5982;&#x9884;&#x671F;&#x7684;&#x90A3;&#x6837;&#xFF0C;<code>main</code>&#x7684;&#x5730;&#x5740;&#x6700;&#x4F4E;&#xFF0C;&#x968F;&#x540E;&#x662F;<code>global</code>&#x548C;<code>p</code>&#x3002;<code>local</code>&#x7684;&#x5730;&#x5740;&#x4F1A;&#x66F4;&#x5927;&#xFF0C;&#x5B83;&#x662F;12&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x6BCF;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x5BF9;&#x5E94;4&#x6BD4;&#x7279;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x662F;48&#x4F4D;&#x7684;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x8868;&#x660E;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x53EF;&#x7528;&#x90E8;&#x5206;&#x4E3A;<code>2  ** 48</code>&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7EC3;&#x4E60;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x4F60;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5C06;&#x4F60;&#x7684;&#x7ED3;&#x679C;&#x4E0E;&#x6211;&#x7684;&#x7ED3;&#x679C;&#x6BD4;&#x8F83;&#x3002;&#x6DFB;&#x52A0;&#x5BF9;<code>malloc</code>&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x8C03;&#x7528;&#x6765;&#x68C0;&#x67E5;&#x4F60;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5806;&#x533A;&#x662F;&#x5426;&#x5411;&#x4E0A;&#x589E;&#x957F;&#xFF08;&#x5730;&#x5740;&#x66F4;&#x9AD8;&#xFF09;&#x3002;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x6253;&#x5370;&#x51FA;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x68C0;&#x67E5;&#x6808;&#x662F;&#x5426;&#x5411;&#x4E0B;&#x589E;&#x957F;&#x3002;</p>
<h2 id="35-&#x9759;&#x6001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;">3.5 &#x9759;&#x6001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;</h2>
<p>&#x6808;&#x4E0A;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x201C;&#x81EA;&#x52A8;&#x53D8;&#x91CF;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5F53;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x65F6;&#x81EA;&#x52A8;&#x88AB;&#x5206;&#x914D;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x81EA;&#x52A8;&#x88AB;&#x91CA;&#x653E;&#x3002;</p>
<p>C&#x8BED;&#x8A00;&#x4E2D;&#x53C8;&#x53E6;&#x4E00;&#x79CD;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x201D;&#xFF0C;&#x5B83;&#x5206;&#x914D;&#x5728;&#x5728;<code>static</code>&#x6BB5;&#x4E0A;&#x3002;&#x5B83;&#x5728;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E4B;&#x95F4;&#x4FDD;&#x5B58;&#x5B83;&#x7684;&#x503C;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x51FD;&#x6570;&#x8DDF;&#x8E2A;&#x4E86;&#x5B83;&#x6240;&#x8C03;&#x7528;&#x7684;&#x6B21;&#x6570;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">times_called</span><span class="hljs-params">()</span>
</span>{
  <span class="hljs-keyword">static</span> <span class="hljs-keyword">int</span> counter = <span class="hljs-number">0</span>;
  counter++;
  <span class="hljs-keyword">return</span> counter;
}
</code></pre>
<p><code>static</code>&#x5173;&#x952E;&#x5B57;&#x8868;&#x793A;<code>counter</code>&#x662F;&#x9759;&#x6001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x5B83;&#x7684;&#x521D;&#x59CB;&#x5316;&#x53EA;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#xFF0C;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5C06;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x5230;<code>aspace.c</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;<code>counter</code>&#x548C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E00;&#x8D77;&#x5206;&#x914D;&#x5728;<code>static</code>&#x6BB5;&#x4E0A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6808;&#x4E0A;&#x3002;</p>
<h2 id="36-&#x5730;&#x5740;&#x7FFB;&#x8BD1;">3.6 &#x5730;&#x5740;&#x7FFB;&#x8BD1;</h2>
<p>&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF08;VA&#xFF09;&#x5982;&#x4F55;&#x7FFB;&#x8BD1;&#x6210;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF08;PA&#xFF09;&#xFF1F;&#x57FA;&#x672C;&#x7684;&#x673A;&#x5236;&#x5341;&#x5206;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x5341;&#x5206;&#x8017;&#x65F6;&#xFF0C;&#x5E76;&#x4E14;&#x5360;&#x636E;&#x5927;&#x91CF;&#x7A7A;&#x95F4;&#x3002;&#x6240;&#x4EE5;&#x5B9E;&#x9645;&#x7684;&#x5B9E;&#x73B0;&#x4F1A;&#x590D;&#x6742;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x5904;&#x7406;&#x5668;&#x63D0;&#x4F9B;&#x4E86;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;&#xFF08;MMU&#xFF09;&#xFF0C;&#x4F4D;&#x4E8E;CPU&#x548C;&#x4E3B;&#x5B58;&#x4E4B;&#x95F4;&#x3002;MMU&#x5728;VA&#x548C;PA&#x4E4B;&#x95F4;&#x6267;&#x884C;&#x5FEB;&#x901F;&#x7684;&#x7FFB;&#x8BD1;&#x3002;</p>
<ol>
<li>&#x5F53;&#x7A0B;&#x5E8F;&#x8BFB;&#x5199;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;CPU&#x4F1A;&#x5F97;&#x5230;VA&#x3002;</li>
<li>MMU&#x5C06;VA&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x79F0;&#x4E3A;&#x9875;&#x7801;&#x548C;&#x504F;&#x79FB;&#x3002;&#x201C;&#x9875;&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x786C;&#x4EF6;&#xFF0C;&#x901A;&#x5E38;&#x4E3A;1~4KiB&#x3002;</li>
<li>MMU&#x5728;&#x201C;&#x9875;&#x8868;&#x201D;&#x91CC;&#x67E5;&#x627E;&#x9875;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x83B7;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x7269;&#x7406;&#x9875;&#x7801;&#x3002;&#x4E4B;&#x540E;&#x5B83;&#x5C06;&#x7269;&#x7406;&#x9875;&#x7801;&#x548C;&#x504F;&#x79FB;&#x7EC4;&#x5408;&#x5F97;&#x5230;PA&#x3002;</li>
<li>PA&#x4F20;&#x9012;&#x7ED9;&#x4E3B;&#x5B58;&#xFF0C;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x6307;&#x5B9A;&#x5730;&#x5740;&#x3002;</li>
</ol>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;VA&#x4E3A;32&#x4F4D;&#xFF0C;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E3A;1GiB&#xFF0C;&#x5212;&#x5206;&#x4E3A;1KiB&#x7684;&#x9875;&#x9762;&#x3002;</p>
<ul>
<li>&#x7531;&#x4E8E;1GiB&#x4E3A;<code>2 ** 30</code>&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x7269;&#x7406;&#x9875;&#x7684;&#x6570;&#x91CF;&#x4E3A;<code>2 ** 20</code>&#x4E2A;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;&#x5E27;&#x201D;&#x3002;</li>
<li>&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x4E3A;<code>2 ** 32</code>&#x5B57;&#x8282;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x4E3A;<code>2 ** 10</code>&#x5B57;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#x5171;&#x6709;<code>2 ** 22</code>&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x3002;</li>
<li>&#x504F;&#x79FB;&#x7684;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x4E3A;<code>2 ** 10</code>&#x5B57;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;10&#x4F4D;&#x6765;&#x6307;&#x5B9A;&#x9875;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x3002;</li>
<li>&#x5982;&#x679C;VA&#x662F;32&#x4F4D;&#xFF0C;&#x800C;&#x504F;&#x79FB;&#x662F;10&#x4F4D;&#xFF0C;&#x5269;&#x4F59;&#x7684;22&#x4F4D;&#x6784;&#x6210;&#x4E86;&#x865A;&#x62DF;&#x9875;&#x7801;&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x5171;&#x6709;<code>2 ** 20</code>&#x4E2A;&#x7269;&#x7406;&#x9875;&#xFF0C;&#x6BCF;&#x4E2A;&#x7269;&#x7406;&#x9875;&#x7801;&#x662F;20&#x4F4D;&#x3002;&#x52A0;&#x4E0A;10&#x4F4D;&#x7684;&#x504F;&#x79FB;&#xFF0C;PA&#x7684;&#x7ED3;&#x679C;&#x4E3A;30&#x4F4D;&#x3002;</li>
</ul>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;&#x4F46;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x9875;&#x8868;&#x5E94;&#x8BE5;&#x5360;&#x591A;&#x5927;&#x3002;&#x9875;&#x8868;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x3002;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x9875;&#x7801;&#xFF0C;&#x5728;&#x4F8B;&#x5B50;&#x4E2D;&#x5B83;&#x662F;20&#x4F4D;&#xFF0C;&#x52A0;&#x4E0A;&#x6BCF;&#x5E27;&#x7684;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x5360;&#x7528;3~4&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x7531;&#x4E8E;&#x5171;&#x6709;<code>2 ** 22</code>&#x4E2A;&#x865A;&#x62DF;&#x9875;&#xFF0C;&#x9875;&#x9762;&#x5171;&#x9700;&#x8981;<code>2 ** 24</code>&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6216;16MiB&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9875;&#x8868;&#xFF0C;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;256&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x7CFB;&#x7EDF;&#x5C31;&#x9700;&#x8981;<code>2 ** 32</code>&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6216;&#x8005;4GiB&#xFF0C;&#x8FD9;&#x8FD8;&#x53EA;&#x662F;&#x9875;&#x8868;&#x7684;&#x7A7A;&#x95F4;&#xFF01;&#x8FD9;&#x4E9B;&#x5C31;&#x5360;&#x7528;&#x4E86;&#x5168;&#x90E8;32&#x4F4D;&#x865A;&#x62DF;&#x5730;&#x5740;&#x3002;&#x800C;&#x5728;48&#x6216;64&#x4F4D;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x91CF;&#x66F4;&#x52A0;&#x8352;&#x8C2C;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x8FDB;&#x7A0B;&#x4E0D;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x6BCF;&#x4E2A;&#x5C0F;&#x7247;&#x6BB5;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0D;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x9875;&#x8868;&#x4E2D;&#x4E3A;&#x5176;&#x5206;&#x914D;&#x6761;&#x76EE;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x9875;&#x8868;&#x662F;&#x201C;&#x7A00;&#x758F;&#x201D;&#x7684;&#xFF0C;&#x8FD9;&#x6697;&#x793A;&#x4E86;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5373;&#x9875;&#x8868;&#x6761;&#x76EE;&#x7684;&#x6570;&#x7EC4;&#x662F;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x7A00;&#x758F;&#x6570;&#x7EC4;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x9519;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x591A;&#x7EA7;&#x9875;&#x8868;&#xFF0C;&#x5B83;&#x88AB;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F8B;&#x5982;Linux&#x6240;&#x91C7;&#x7528;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5173;&#x8054;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x5305;&#x542B;&#x865A;&#x62DF;&#x9875;&#x7801;&#x548C;&#x7269;&#x7406;&#x9875;&#x7801;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x4E0A;&#x641C;&#x7D22;&#x5173;&#x8054;&#x8868;&#x4F1A;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x4F46;&#x662F;&#x786C;&#x4EF6;&#x4E0A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x641C;&#x7D22;&#x6574;&#x4E2A;&#x8868;&#xFF0C;&#x6240;&#x4EE5;&#x5173;&#x8054;&#x6570;&#x7EC4;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x5728;MMU&#x4E2D;&#x8868;&#x793A;&#x9875;&#x8868;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;<a href="http://en.wikipedia.org/wiki/Page_table" target="_blank">&#x9875;&#x8868;&#x7684;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x9875;&#x9762;</a>&#x9605;&#x8BFB;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x627E;&#x5230;&#x6709;&#x8DA3;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x4F46;&#x662F;&#x57FA;&#x672C;&#x7684;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#x9875;&#x8868;&#x5E94;&#x505A;&#x6210;&#x7A00;&#x758F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;&#x7A00;&#x758F;&#x6570;&#x7EC4;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x4E86;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4E2D;&#x65AD;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x4FDD;&#x5B58;&#x5B83;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E4B;&#x540E;&#x8FD0;&#x884C;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x673A;&#x5236;&#x53EB;&#x505A;&#x201C;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x201D;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x9875;&#x8868;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x548C;MMU&#x914D;&#x5408;&#x6765;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x62FF;&#x5230;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x9875;&#x8868;&#x3002;&#x5728;&#x65E7;&#x673A;&#x5668;&#x4E0A;&#xFF0C;MMU&#x4E2D;&#x7684;&#x9875;&#x8868;&#x4FE1;&#x606F;&#x5728;&#x6BCF;&#x6B21;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x65F6;&#x4F1A;&#x88AB;&#x66FF;&#x6362;&#x6389;&#xFF0C;&#x5F00;&#x9500;&#x975E;&#x5E38;&#x5927;&#x3002;&#x5728;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;MMU&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x8868;&#x6761;&#x76EE;&#x5305;&#x542B;&#x8FDB;&#x7A0B;ID&#xFF0C;&#x6240;&#x4EE5;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x9875;&#x8868;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x50A8;&#x5B58;&#x5728;MMU&#x4E2D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch2.html" class="navigation navigation-prev " aria-label="Previous page: 第二章 进程">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch4.html" class="navigation navigation-next " aria-label="Next page: 第四章 文件和文件系统">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章 虚拟内存","level":"1.5","depth":1,"next":{"title":"第四章 文件和文件系统","level":"1.6","depth":1,"path":"ch4.md","ref":"ch4.md","articles":[]},"previous":{"title":"第二章 进程","level":"1.4","depth":1,"path":"ch2.md","ref":"ch2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch3.md","mtime":"2018-01-28T13:50:43.816Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-01-28T13:55:30.349Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

