
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第六章 内存管理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch7.html" />
    
    
    <link rel="prev" href="ch5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    操作系统思考 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch0.html">
            
                <a href="ch0.html">
            
                    
                    第零章 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 进程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 虚拟内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 文件和文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 更多的位与字节
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 缓存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 多任务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章 线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章 条件变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章 C语言中的信号量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="donors.html">
            
                <a href="donors.html">
            
                    
                    捐赠名单
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第六章 内存管理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x516D;&#x7AE0;-&#x5185;&#x5B58;&#x7BA1;&#x7406;">&#x7B2C;&#x516D;&#x7AE0; &#x5185;&#x5B58;&#x7BA1;&#x7406;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;<a href="http://greenteapress.com/wp/" target="_blank">Allen B. Downey</a></p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://greenteapress.com/thinkos/html/thinkos007.html" target="_blank">Chapter 6  Memory management</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<p>C&#x63D0;&#x4F9B;&#x4E86;4&#x79CD;&#x7528;&#x4E8E;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<ul>
<li><code>malloc</code>&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x8868;&#x793A;&#x5B57;&#x8282;&#x5355;&#x4F4D;&#x7684;&#x5927;&#x5C0F;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x6307;&#x5411;&#x65B0;&#x5206;&#x914D;&#x7684;&#x3001;&#xFF08;&#x81F3;&#x5C11;&#xFF09;&#x4E3A;&#x6307;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#x7684;&#x6307;&#x9488;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#xFF0C;&#x5B83;&#x4F1A;&#x8FD4;&#x56DE;&#x7279;&#x6B8A;&#x7684;&#x503C;&#x4E3A;<code>NULL</code>&#x7684;&#x6307;&#x9488;&#x3002;</li>
<li><code>calloc</code>&#xFF0C;&#x5B83;&#x548C;<code>malloc</code>&#x4E00;&#x6837;&#xFF0C;&#x9664;&#x4E86;&#x5B83;&#x4F1A;&#x6E05;&#x7A7A;&#x65B0;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B83;&#x4F1A;&#x8BBE;&#x7F6E;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x5B57;&#x8282;&#x4E3A;0&#x3002;</li>
<li><code>free</code>&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x6307;&#x5411;&#x4E4B;&#x524D;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5E76;&#x4F1A;&#x91CA;&#x653E;&#x5B83;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F7F;&#x8FD9;&#x5757;&#x7A7A;&#x95F4;&#x53EF;&#x7528;&#x4E8E;&#x672A;&#x6765;&#x7684;&#x5206;&#x914D;&#x3002;</li>
<li><code>realloc</code>&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x6307;&#x5411;&#x4E4B;&#x524D;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x5927;&#x5C0F;&#x6765;&#x5206;&#x914D;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5C06;&#x65E7;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x65B0;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#xFF0C;&#x91CA;&#x653E;&#x65E7;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x6307;&#x5411;&#x65B0;&#x5185;&#x5B58;&#x5757;&#x7684;&#x6307;&#x9488;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x5957;API&#x662F;&#x51FA;&#x4E86;&#x540D;&#x7684;&#x6613;&#x9519;&#x548C;&#x82DB;&#x523B;&#x3002;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x662F;&#x8BBE;&#x8BA1;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6700;&#x5177;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x6B63;&#x662F;&#x8BB8;&#x591A;&#x73B0;&#x4EE3;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x9AD8;&#x9636;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7279;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h2 id="61-&#x5185;&#x5B58;&#x9519;&#x8BEF;">6.1 &#x5185;&#x5B58;&#x9519;&#x8BEF;</h2>
<p>C&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;API&#x6709;&#x70B9;&#x50CF;Jasper Beardly&#xFF0C;&#x52A8;&#x753B;&#x7247;&#x300A;&#x8F9B;&#x666E;&#x68EE;&#x4E00;&#x5BB6;&#x300B;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x914D;&#x89D2;&#xFF0C;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x4E25;&#x5389;&#x7684;&#x4EE3;&#x8BFE;&#x8001;&#x5E08;&#xFF0C;&#x559C;&#x6B22;&#x4F53;&#x7F5A;&#x522B;&#x4EBA;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6212;&#x5C3A;&#x60E9;&#x7F5A;&#x4EFB;&#x4F55;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x5E94;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x7684;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4F60;&#x8BBF;&#x95EE;&#x4EFB;&#x4F55;&#x6CA1;&#x6709;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5C31;&#x5E94;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x91CA;&#x653E;&#x4E86;&#x67D0;&#x4E2A;&#x5185;&#x5B58;&#x5757;&#x4E4B;&#x540E;&#x518D;&#x8BBF;&#x95EE;&#x5B83;&#xFF0C;&#x5C31;&#x5E94;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x5C1D;&#x8BD5;&#x91CA;&#x653E;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5C31;&#x5E94;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x91CA;&#x653E;&#x591A;&#x6B21;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5C31;&#x5E94;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x6CA1;&#x6709;&#x5206;&#x914D;&#x6216;&#x8005;&#x5DF2;&#x7ECF;&#x91CA;&#x653E;&#x7684;&#x5185;&#x5B58;&#x5757;&#x8C03;&#x7528;<code>realloc</code>&#xFF0C;&#x5C31;&#x5E94;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x542C;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x4E0D;&#x96BE;&#x9075;&#x5FAA;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x53EF;&#x80FD;&#x7531;&#x7A0B;&#x5E8F;&#x4E00;&#x90E8;&#x5206;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x4E4B;&#x540E;&#x5728;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x4E2D;&#x91CA;&#x653E;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#x7684;&#x53D8;&#x5316;&#x4E5F;&#x9700;&#x8981;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x8DDF;&#x7740;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5757;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x8BB8;&#x591A;&#x522B;&#x540D;&#x6216;&#x8005;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x5757;&#x5728;&#x6240;&#x6709;&#x5F15;&#x7528;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x624D;&#x5E94;&#x8BE5;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x6B63;&#x786E;&#x5904;&#x7406;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x901A;&#x5E38;&#x9700;&#x8981;&#x7EC6;&#x5FC3;&#x7684;&#x5206;&#x6790;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x826F;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x76F8;&#x8FDD;&#x80CC;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x5E94;&#x5305;&#x542B;&#x5185;&#x5B58;&#x5982;&#x4F55;&#x91CA;&#x653E;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F5C;&#x4E3A;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6210;&#x719F;&#x7684;&#x5E93;&#x901A;&#x5E38;&#x505A;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x5B9E;&#x8DF5;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x7406;&#x60F3;&#x5316;&#x7684;&#x3002;</p>
<p>&#x5185;&#x5B58;&#x9519;&#x8BEF;&#x975E;&#x5E38;&#x96BE;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x75C7;&#x72B6;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4E8B;&#x60C5;&#x66F4;&#x52A0;&#x7CDF;&#x7CD5;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4ECE;&#x672A;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#x8BFB;&#x53D6;&#x503C;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4F1A;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x89E6;&#x53D1;&#x53EB;&#x505A;&#x201C;&#x6BB5;&#x9519;&#x8BEF;&#x201D;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x4E14;&#x4E2D;&#x6B62;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x975E;&#x5E38;&#x5408;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8868;&#x793A;&#x7A0B;&#x5E8F;&#x6240;&#x8BFB;&#x53D6;&#x7684;&#x4F4D;&#x7F6E;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x7ED3;&#x679C;&#x975E;&#x5E38;&#x5C11;&#x89C1;&#x3002;&#x66F4;&#x901A;&#x5E38;&#x7684;&#x662F;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BFB;&#x53D6;&#x4E86;&#x672A;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x7A0B;&#x5E8F;&#x6240;&#x8BFB;&#x53D6;&#x7684;&#x672A;&#x5206;&#x914D;&#x5185;&#x5B58;&#x6B63;&#x597D;&#x50A8;&#x5B58;&#x5728;&#x4E00;&#x5757;&#x7279;&#x5B9A;&#x533A;&#x57DF;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x503C;&#x6CA1;&#x6709;&#x89E3;&#x91CA;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x4F1A;&#x96BE;&#x4EE5;&#x89E3;&#x91CA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BFB;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x89E3;&#x91CA;&#x4E3A;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x65E0;&#x6548;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x975E;&#x5E38;&#x5927;&#x6216;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x6570;&#x503C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5411;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x5B83;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x7684;&#x503C;&#xFF0C;&#x7ED3;&#x679C;&#x4F1A;&#x975E;&#x5E38;&#x602A;&#x5F02;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x5411;&#x672A;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#x5199;&#x5165;&#x503C;&#xFF0C;&#x4F1A;&#x66F4;&#x52A0;&#x7CDF;&#x7CD5;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x503C;&#x88AB;&#x5199;&#x5165;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x503C;&#x624D;&#x80FD;&#x88AB;&#x8BFB;&#x53D6;&#x5E76;&#x4E14;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x3002;&#x6B64;&#x65F6;&#x5BFB;&#x627E;&#x95EE;&#x9898;&#x6765;&#x6E90;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x4E8B;&#x60C5;&#x8FD8;&#x53EF;&#x80FD;&#x66F4;&#x52A0;&#x7CDF;&#x7CD5;&#xFF01;C&#x98CE;&#x683C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x4E00;&#x4E2A;&#x6700;&#x666E;&#x904D;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;<code>malloc</code>&#x548C;<code>free</code>&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#xFF09;&#x901A;&#x5E38;&#x548C;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x50A8;&#x5B58;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x65E0;&#x610F;&#x4E2D;&#x8D8A;&#x8FC7;&#x52A8;&#x6001;&#x5206;&#x914D;&#x5757;&#x7684;&#x672B;&#x5C3E;&#x5199;&#x5165;&#x503C;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x80FD;&#x7834;&#x574F;&#x4E86;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x76F4;&#x5230;&#x6700;&#x540E;&#x624D;&#x4F1A;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x4F60;&#x8C03;&#x7528;<code>malloc</code>&#x6216;<code>free</code>&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x4F1A;&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x8C1C;&#x4E4B;&#x539F;&#x56E0;&#x8C03;&#x7528;&#x5931;&#x8D25;&#x3002;</li>
</ul>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x4ECE;&#x4E2D;&#x603B;&#x7ED3;&#x51FA;&#x4E00;&#x6761;&#x89C4;&#x5F8B;&#xFF0C;&#x5C31;&#x662F;&#x5B89;&#x5168;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x548C;&#x89C4;&#x8303;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7F16;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x5E93;&#x6216;&#x6A21;&#x5757;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x91CA;&#x653E;&#x5B83;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4ECE;&#x5F00;&#x59CB;&#x5C31;&#x5E94;&#x8BE5;&#x4F5C;&#x4E3A;API&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x5E93;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x6309;&#x7167;&#x89C4;&#x8303;&#x4F7F;&#x7528;API&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x50A8;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x6216;&#x90FD;&#x4E0D;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x4E0D;&#x662F;<code>malloc</code>&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x4E0A;&#x8C03;&#x7528;<code>free</code>&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x4E2D;&#x6301;&#x6709;&#x76F8;&#x540C;&#x5185;&#x5B58;&#x5757;&#x7684;&#x591A;&#x4E2A;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x5728;&#x5B89;&#x5168;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x548C;&#x6027;&#x80FD;&#x4E4B;&#x95F4;&#x6709;&#x4E2A;&#x6743;&#x8861;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5185;&#x5B58;&#x9519;&#x8BEF;&#x7684;&#x7684;&#x6700;&#x666E;&#x904D;&#x6765;&#x6E90;&#x662F;&#x6570;&#x7EC4;&#x7684;&#x8D8A;&#x754C;&#x5199;&#x5165;&#x3002;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x6700;&#x663E;&#x7136;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8FB9;&#x754C;&#x68C0;&#x67E5;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6BCF;&#x6B21;&#x5BF9;&#x6570;&#x7EC4;&#x7684;&#x8BBF;&#x95EE;&#x90FD;&#x5E94;&#x8BE5;&#x68C0;&#x67E5;&#x4E0B;&#x6807;&#x662F;&#x5426;&#x8D8A;&#x754C;&#x3002;&#x63D0;&#x4F9B;&#x6570;&#x7EC4;&#x7ED3;&#x6784;&#x7684;&#x9AD8;&#x9636;&#x5E93;&#x901A;&#x5E38;&#x4F1A;&#x8FDB;&#x884C;&#x8FB9;&#x754C;&#x68C0;&#x67E5;&#x3002;&#x4F46;&#x662F;C&#x98CE;&#x683C;&#x6570;&#x636E;&#x548C;&#x5927;&#x591A;&#x6570;&#x5E95;&#x5C42;&#x5E93;&#x4E0D;&#x4F1A;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<h2 id="62-&#x5185;&#x5B58;&#x6CC4;&#x6F0F;">6.2 &#x5185;&#x5B58;&#x6CC4;&#x6F0F;</h2>
<p>&#x6709;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x4F1A;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x7684;&#x5185;&#x5B58;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5206;&#x914D;&#x4E86;&#x4E00;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x91CA;&#x653E;&#x5B83;&#xFF0C;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x201C;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x201D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#xFF0C;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x662F;OK&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x5BF9;&#x5176;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x4E4B;&#x540E;&#x9000;&#x51FA;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x3002;&#x5F53;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x90FD;&#x4F1A;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x91CA;&#x653E;&#x3002;&#x5728;&#x9000;&#x51FA;&#x524D;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x4F3C;&#x4E4E;&#x5F88;&#x8D1F;&#x8D23;&#x4EFB;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x5E38;&#x5F88;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x6CC4;&#x9732;&#x5185;&#x5B58;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x603B;&#x91CF;&#x4F1A;&#x65E0;&#x9650;&#x589E;&#x957F;&#x3002;&#x6B64;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ul>
<li>&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8017;&#x5B8C;&#x6240;&#x6709;&#x7269;&#x7406;&#x5185;&#x5B58;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x4E0B;&#x4E00;&#x6B21;&#x7684;<code>malloc</code>&#x8C03;&#x7528;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x8FD4;&#x56DE;<code>NULL</code>&#x3002;</li>
<li>&#x5728;&#x5E26;&#x6709;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x7684;&#x9875;&#x9762;&#x4ECE;&#x5185;&#x5B58;&#x79FB;&#x52A8;&#x5230;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x4E4B;&#x540E;&#x5206;&#x914D;&#x66F4;&#x591A;&#x7A7A;&#x95F4;&#x7ED9;&#x6CC4;&#x9732;&#x7684;&#x8FDB;&#x7A0B;&#x3002;&#x6211;&#x4F1A;&#x5728;7.8&#x8282;&#x89E3;&#x91CA;&#x8FD9;&#x4E00;&#x673A;&#x5236;&#x3002;</li>
<li>&#x5355;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x6709;&#x5185;&#x5B58;&#x603B;&#x91CF;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x8D85;&#x8FC7;&#x5B83;&#x7684;&#x8BDD;&#xFF0C;<code>malloc</code>&#x4F1A;&#x8FD4;&#x56DE;<code>NULL</code>&#x3002;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x5B8C;&#x5B83;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF08;&#x6216;&#x8005;&#x53EF;&#x7528;&#x7684;&#x90E8;&#x5206;&#xFF09;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5730;&#x5740;&#x53EF;&#x5206;&#x914D;&#xFF0C;<code>malloc</code>&#x4F1A;&#x8FD4;&#x56DE;<code>NULL</code>&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;<code>malloc</code>&#x8FD4;&#x56DE;&#x4E86;<code>NULL</code>&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4ECD;&#x65E7;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5757;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x6BB5;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x68C0;&#x67E5;<code>malloc</code>&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x3002;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5728;&#x6BCF;&#x4E2A;<code>malloc</code>&#x8C03;&#x7528;&#x4E4B;&#x540E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-keyword">void</span> *p = <span class="hljs-built_in">malloc</span>(size);
<span class="hljs-keyword">if</span> (p == <span class="hljs-literal">NULL</span>) {
    perror(<span class="hljs-string">&quot;malloc failed&quot;</span>);
    <span class="hljs-built_in">exit</span>(<span class="hljs-number">-1</span>);
}
</code></pre>
<p><code>perror</code>&#x5728;<code>stdio.h</code>&#x4E2D;&#x58F0;&#x660E;&#xFF0C;&#x5B83;&#x4F1A;&#x6253;&#x5370;&#x51FA;&#x5173;&#x4E8E;&#x6700;&#x540E;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x548C;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p><code>exit</code>&#x5728;<code>stdlib.h</code>&#x4E2D;&#x58F0;&#x660E;&#xFF0C;&#x4F1A;&#x4F7F;&#x8FDB;&#x7A0B;&#x7EC8;&#x6B62;&#x3002;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x5982;&#x4F55;&#x7EC8;&#x6B62;&#x7684;&#x72B6;&#x6001;&#x7801;&#x3002;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x72B6;&#x6001;&#x7801;0&#x8868;&#x793A;&#x901A;&#x5E38;&#x7EC8;&#x6B62;&#xFF0C;-1&#x8868;&#x793A;&#x9519;&#x8BEF;&#x60C5;&#x51B5;&#x3002;&#x6709;&#x65F6;&#x5176;&#x5B83;&#x72B6;&#x6001;&#x7801;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x9519;&#x8BEF;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x9519;&#x8BEF;&#x68C0;&#x67E5;&#x7684;&#x4EE3;&#x7801;&#x5341;&#x5206;&#x8BA8;&#x538C;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7A0B;&#x5E8F;&#x96BE;&#x4EE5;&#x9605;&#x8BFB;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x5E93;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x548C;&#x9519;&#x8BEF;&#x68C0;&#x67E5;&#x5305;&#x88C5;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x68C0;&#x67E5;&#x8FD4;&#x56DE;&#x503C;&#x7684;<code>malloc</code>&#x5305;&#x88C5;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> *<span class="hljs-title">check_malloc</span><span class="hljs-params">(<span class="hljs-keyword">int</span> size)</span>
</span>{
  <span class="hljs-keyword">void</span> *p = <span class="hljs-built_in">malloc</span> (size);
  <span class="hljs-keyword">if</span> (p == <span class="hljs-literal">NULL</span>) {
    perror(<span class="hljs-string">&quot;malloc failed&quot;</span>);
    <span class="hljs-built_in">exit</span>(<span class="hljs-number">-1</span>);
  }
  <span class="hljs-keyword">return</span> p;
}
</code></pre>
<p>&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x591A;&#x6570;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F8B;&#x5982;Web&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x4F1A;&#x6CC4;&#x9732;&#x5185;&#x5B58;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Unix&#x7684;<code>ps</code>&#x548C;<code>top</code>&#x5DE5;&#x5177;&#x6765;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x54EA;&#x4E2A;&#x7A0B;&#x5E8F;&#x5360;&#x7528;&#x4E86;&#x6700;&#x591A;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<h2 id="63-&#x5B9E;&#x73B0;">6.3 &#x5B9E;&#x73B0;</h2>
<p>&#x5F53;&#x8FDB;&#x7A0B;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E3A;<code>text</code>&#x6BB5;&#x3001;&#x9759;&#x6001;&#x5206;&#x914D;&#x7684;&#x6570;&#x636E;&#x3001;&#x6808;&#x548C;&#x5806;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF0C;&#x5806;&#x4E2D;&#x542B;&#x6709;&#x52A8;&#x6001;&#x5206;&#x914D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x90FD;&#x52A8;&#x6001;&#x5206;&#x914D;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x5806;&#x7684;&#x5927;&#x5C0F;&#x53EF;&#x80FD;&#x5F88;&#x5C0F;&#xFF0C;&#x6216;&#x8005;&#x4E3A;0&#x3002;&#x6700;&#x5F00;&#x59CB;&#x5806;&#x53EA;&#x542B;&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x5757;&#x3002;</p>
<p><code>malloc</code>&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F2;&#x5757;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x5927;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5B83;&#x4F1A;&#x5411;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x66F4;&#x591A;&#x5185;&#x5B58;&#x3002;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x51FD;&#x6570;&#x53EB;&#x505A;<code>sbrk</code>&#xFF0C;&#x5B83;&#x8BBE;&#x7F6E;&#x201C;&#x7A0B;&#x5E8F;&#x4E2D;&#x65AD;&#x70B9;&#x201D;&#xFF08;program break&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x770B;&#x505A;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5806;&#x5E95;&#x90E8;&#x7684;&#x6307;&#x9488;&#x3002;</p>
<blockquote>
<p>&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;<code>sbrk</code>&#x662F;Linux&#x4E0A;&#x7684;&#x7CFB;&#x7EDF;API&#xFF0C;Windows&#x4E0A;&#x4F7F;&#x7528;<code>HeapAlloc</code>&#x548C;<code>HeapFree</code>&#x6765;&#x7BA1;&#x7406;&#x5806;&#x533A;&#x3002;</p>
</blockquote>
<p><code>sbrk</code>&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x5206;&#x914D;&#x7684;&#x65B0;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x9875;&#xFF0C;&#x66F4;&#x65B0;&#x8FDB;&#x7A0B;&#x7684;&#x9875;&#x8868;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x7A0B;&#x5E8F;&#x4E2D;&#x65AD;&#x70B9;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;<code>sbrk</code>&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;<code>malloc</code>&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x81EA;&#x5DF1;&#x7BA1;&#x7406;&#x5806;&#x533A;&#x3002;&#x4F46;&#x662F;<code>malloc</code>&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x5FEB;&#x5E76;&#x4E14;&#x9AD8;&#x6548;&#x5229;&#x7528;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5185;&#x5B58;&#x7BA1;&#x7406;API&#xFF0C;&#x591A;&#x6570;Linux&#x7CFB;&#x7EDF;&#x90FD;&#x4F7F;&#x7528;<code>ptmalloc</code>&#xFF0C;&#x5B83;&#x57FA;&#x4E8E;<code>dlmalloc</code>&#xFF0C;&#x7531;Doug Lea&#x7F16;&#x5199;&#x3002;&#x4E00;&#x7BC7;&#x63CF;&#x8FF0;&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x8981;&#x7D20;&#x7684;&#x8BBA;&#x6587;&#x53EF;&#x5728;<a href="http://gee.cs.oswego.edu/dl/html/malloc.html" target="_blank">http://gee.cs.oswego.edu/dl/html/malloc.html</a>&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8981;&#x7D20;&#x662F;&#xFF1A;</p>
<ul>
<li><code>malloc</code>&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x901A;&#x5E38;&#x4E0D;&#x4F9D;&#x8D56;&#x5757;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x6570;&#x91CF;&#x3002;<code>free</code>&#x901A;&#x5E38;&#x5F88;&#x5FEB;&#xFF0C;&#x548C;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x6570;&#x91CF;&#x65E0;&#x5173;&#x3002;&#x56E0;&#x4E3A;<code>calloc</code>&#x4F1A;&#x6E05;&#x7A7A;&#x5757;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E;&#x5757;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x4EE5;&#x53CA;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x6570;&#x91CF;&#xFF09;&#x3002;<code>realloc</code>&#x6709;&#x65F6;&#x5F88;&#x5FEB;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x7684;&#x5927;&#x5C0F;&#x6BD4;&#x4E4B;&#x524D;&#x66F4;&#x5C0F;&#xFF0C;&#x6216;&#x8005;&#x7A7A;&#x95F4;&#x53EF;&#x7528;&#x4E8E;&#x6269;&#x5C55;&#x73B0;&#x6709;&#x7684;&#x5185;&#x5B58;&#x5757;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4ECE;&#x65E7;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#x590D;&#x5236;&#x6570;&#x636E;&#x5230;&#x65B0;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E;&#x65E7;&#x5185;&#x5B58;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
<li>&#x8FB9;&#x754C;&#x6807;&#x7B7E;&#xFF1A;&#x5F53;<code>malloc</code>&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5FEB;&#x65F6;&#xFF0C;&#x5B83;&#x5728;&#x5934;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#x6DFB;&#x52A0;&#x7A7A;&#x95F4;&#x6765;&#x50A8;&#x5B58;&#x5757;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x72B6;&#x6001;&#xFF08;&#x5206;&#x914D;&#x8FD8;&#x662F;&#x91CA;&#x653E;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4F4D;&#x53EB;&#x505A;&#x201C;&#x8FB9;&#x754C;&#x6807;&#x7B7E;&#x201D;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6807;&#x7B7E;&#xFF0C;<code>malloc</code>&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x4EFB;&#x4F55;&#x5757;&#x79FB;&#x52A8;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x4E0A;&#x4E00;&#x4E2A;&#x6216;&#x4E0B;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7A7A;&#x95F2;&#x5757;&#x4F1A;&#x94FE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x53CC;&#x5411;&#x94FE;&#x8868;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x7A7A;&#x95F2;&#x5757;&#x4E5F;&#x5305;&#x542B;&#x6307;&#x5411;&#x201C;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x201D;&#x4E2D;&#x4E0B;&#x4E00;&#x4E2A;&#x5757;&#x548C;&#x4E0A;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x6307;&#x9488;&#x3002;&#x8FB9;&#x754C;&#x6807;&#x7B7E;&#x548C;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x6307;&#x9488;&#x6784;&#x6210;&#x4E86;<code>malloc</code>&#x7684;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7A7F;&#x63D2;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x5F88;&#x5BB9;&#x6613;&#x7834;&#x574F;&#x5B83;&#x4EEC;&#x3002;</li>
<li>&#x7A7A;&#x95F4;&#x5F00;&#x9500;&#xFF1A;&#x8FB9;&#x754C;&#x6807;&#x7B7E;&#x548C;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x6307;&#x9488;&#x4E5F;&#x5360;&#x636E;&#x7A7A;&#x95F4;&#x3002;&#x6700;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#x5927;&#x5C0F;&#x5728;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E0A;&#x662F;16&#x5B57;&#x8282;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;<code>malloc</code>&#x5728;&#x7A7A;&#x95F4;&#x4E0A;&#x5E76;&#x4E0D;&#x9AD8;&#x6548;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5C0F;&#x578B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x914D;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x53EF;&#x80FD;&#x66F4;&#x9AD8;&#x6548;&#x4E00;&#x4E9B;&#x3002;</li>
<li>&#x788E;&#x7247;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x4EE5;&#x591A;&#x79CD;&#x5927;&#x5C0F;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x5757;&#xFF0C;&#x5806;&#x533A;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x788E;&#x7247;&#x5316;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7A7A;&#x95F2;&#x7A7A;&#x95F4;&#x4F1A;&#x6253;&#x788E;&#x6210;&#x8BB8;&#x591A;&#x5C0F;&#x578B;&#x7247;&#x6BB5;&#x3002;&#x788E;&#x7247;&#x975E;&#x5E38;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x901A;&#x8FC7;&#x4F7F;&#x7F13;&#x5B58;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x6765;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x7684;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x88C5;&#x7BB1;&#x548C;&#x7F13;&#x5B58;&#xFF1A;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x5728;&#x7BB1;&#x5B50;&#x4E2D;&#x4EE5;&#x5927;&#x5C0F;&#x6392;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;<code>malloc</code>&#x641C;&#x7D22;&#x7279;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x5757;&#x65F6;&#xFF0C;&#x5B83;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x5728;&#x54EA;&#x4E2A;&#x7BB1;&#x5B50;&#x4E2D;&#x5BFB;&#x627E;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x91CA;&#x653E;&#x4E86;&#x4E00;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x4E4B;&#x540E;&#x7ACB;&#x5373;&#x4EE5;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x5206;&#x914D;&#x4E00;&#x5757;&#x5185;&#x5B58;&#xFF0C;<code>malloc</code>&#x901A;&#x5E38;&#x4F1A;&#x5F88;&#x5FEB;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch5.html" class="navigation navigation-prev " aria-label="Previous page: 第五章 更多的位与字节">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch7.html" class="navigation navigation-next " aria-label="Next page: 第七章 缓存">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章 内存管理","level":"1.8","depth":1,"next":{"title":"第七章 缓存","level":"1.9","depth":1,"path":"ch7.md","ref":"ch7.md","articles":[]},"previous":{"title":"第五章 更多的位与字节","level":"1.7","depth":1,"path":"ch5.md","ref":"ch5.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch6.md","mtime":"2018-01-28T13:50:43.816Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-01-28T13:55:30.349Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

