
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第七章 缓存 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch8.html" />
    
    
    <link rel="prev" href="ch6.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    操作系统思考 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch0.html">
            
                <a href="ch0.html">
            
                    
                    第零章 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 进程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 虚拟内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 文件和文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 更多的位与字节
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 缓存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 多任务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章 线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章 条件变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章 C语言中的信号量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="donors.html">
            
                <a href="donors.html">
            
                    
                    捐赠名单
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第七章 缓存</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E03;&#x7AE0;-&#x7F13;&#x5B58;">&#x7B2C;&#x4E03;&#x7AE0; &#x7F13;&#x5B58;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;<a href="http://greenteapress.com/wp/" target="_blank">Allen B. Downey</a></p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://greenteapress.com/thinkos/html/thinkos008.html" target="_blank">Chapter 7  Caching</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<h2 id="71-&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x8FD0;&#x884C;">7.1 &#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x8FD0;&#x884C;</h2>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x7F13;&#x5B58;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7406;&#x89E3;&#x8BA1;&#x7B97;&#x673A;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x5B66;&#x4E60;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6765;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x3002;&#x8FD9;&#x4E00;&#x7AE0;&#x4E2D;&#x6211;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7B80;&#x5355;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5F53;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x4EE3;&#x7801;&#xFF08;&#x6216;&#x8005;&#x7A0B;&#x5E8F;&#x6587;&#x672C;&#xFF09;&#x901A;&#x5E38;&#x4F4D;&#x4E8E;&#x786C;&#x76D8;&#x4E0A;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x6765;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E4B;&#x540E;&#x201C;&#x52A0;&#x8F7D;&#x5668;&#x201D;&#x5C06;&#x4EE3;&#x7801;&#x4ECE;&#x5B58;&#x50A8;&#x5668;&#x590D;&#x5236;&#x5230;&#x4E3B;&#x5B58;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>main</code>&#x6765;&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E4B;&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x90FD;&#x50A8;&#x5B58;&#x5728;&#x4E3B;&#x5B58;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5728;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;CPU&#x4E0A;&#x7684;&#x5C0F;&#x578B;&#x50A8;&#x5B58;&#x5355;&#x5143;&#x3002;&#x8FD9;&#x4E9B;&#x5BC4;&#x5B58;&#x5668;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF08;PC&#xFF09;&#xFF0C;&#x5B83;&#x542B;&#x6709;&#x7A0B;&#x5E8F;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF08;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF09;&#x7684;&#x5730;&#x5740;&#x3002;</li>
<li>&#x6307;&#x4EE4;&#x5BC4;&#x5B58;&#x5668;&#xFF08;IR&#xFF09;&#xFF0C;&#x5B83;&#x542B;&#x6709;&#x5F53;&#x524D;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x7684;&#x673A;&#x5668;&#x7801;&#x3002;</li>
<li>&#x6808;&#x6307;&#x9488;&#xFF08;SP&#xFF09;&#xFF0C;&#x5B83;&#x542B;&#x6709;&#x5F53;&#x524D;&#x51FD;&#x6570;&#x6808;&#x5E27;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x7A0B;&#x5E8F;&#x5F53;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x5B58;&#x653E;&#x6570;&#x636E;&#x7684;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#x3002;</li>
<li>&#x72B6;&#x6001;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x542B;&#x6709;&#x5F53;&#x524D;&#x8BA1;&#x7B97;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#x901A;&#x5E38;&#x542B;&#x6709;&#x4E00;&#x4F4D;&#x6765;&#x5B58;&#x50A8;&#x4E0A;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x662F;&#x96F6;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E4B;&#x4E2D;&#xFF0C;CPU&#x6267;&#x884C;&#x4E0B;&#x5217;&#x6B65;&#x9AA4;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x6307;&#x4EE4;&#x5468;&#x671F;&#x201D;&#xFF1A;</p>
<ul>
<li>&#x53D6;&#x6307;&#xFF08;Fetch&#xFF09;&#xFF1A;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x83B7;&#x53D6;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x50A8;&#x5B58;&#x5728;&#x6307;&#x4EE4;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x3002;</li>
<li>&#x8BD1;&#x7801;&#xFF08;Decode&#xFF09;&#xFF1A;CPU&#x7684;&#x4E00;&#x90E8;&#x5206;&#x53EB;&#x505A;&#x201C;&#x63A7;&#x5236;&#x5355;&#x5143;&#x201D;&#xFF0C;&#x5C06;&#x6307;&#x4EE4;&#x8BD1;&#x7801;&#xFF0C;&#x5E76;&#x5411;CPU&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x53D1;&#x9001;&#x4FE1;&#x53F7;&#x3002;</li>
<li>&#x6267;&#x884C;&#xFF08;Execute&#xFF09;&#xFF1A;&#x6536;&#x5230;&#x6765;&#x81EA;&#x63A7;&#x5236;&#x5355;&#x5143;&#x7684;&#x4FE1;&#x53F7;&#x540E;&#x4F1A;&#x6267;&#x884C;&#x5408;&#x9002;&#x7684;&#x8BA1;&#x7B97;&#x3002;</li>
</ul>
<p>&#x5927;&#x591A;&#x6570;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x6267;&#x884C;&#x51E0;&#x767E;&#x6761;&#x4E0D;&#x540C;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x6307;&#x4EE4;&#x96C6;&#x201D;&#x3002;&#x4F46;&#x662F;&#x5927;&#x591A;&#x6570;&#x6307;&#x4EE4;&#x53EF;&#x5F52;&#x4E3A;&#x51E0;&#x4E2A;&#x666E;&#x904D;&#x7684;&#x5206;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x52A0;&#x8F7D;&#xFF1A;&#x5C06;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#x9001;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#x3002;</li>
<li>&#x7B97;&#x672F;/&#x903B;&#x8F91;&#xFF1A;&#x4ECE;&#x5BC4;&#x5B58;&#x5668;&#x52A0;&#x8F7D;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x6267;&#x884C;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x50A8;&#x5B58;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#x3002;</li>
<li>&#x50A8;&#x5B58;&#xFF1A;&#x5C06;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x503C;&#x9001;&#x5230;&#x5185;&#x5B58;&#x3002;</li>
<li>&#x8DF3;&#x8F6C;/&#x5206;&#x652F;&#xFF1A;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4F7F;&#x63A7;&#x5236;&#x6D41;&#x8DF3;&#x5230;&#x7A0B;&#x5E8F;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x5206;&#x652F;&#x901A;&#x5E38;&#x662F;&#x6709;&#x6761;&#x4EF6;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4F1A;&#x68C0;&#x67E5;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x65D7;&#x6807;&#xFF0C;&#x53EA;&#x5728;&#x8BBE;&#x7F6E;&#x65F6;&#x8DF3;&#x8F6C;&#x3002;</li>
</ul>
<p>&#x4E00;&#x4E9B;&#x6307;&#x4EE4;&#x96C6;&#xFF0C;&#x5305;&#x62EC;&#x666E;&#x904D;&#x7684;x86&#xFF0C;&#x63D0;&#x4F9B;&#x52A0;&#x8F7D;&#x548C;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7684;&#x6DF7;&#x5408;&#x6307;&#x4EE4;&#x3002;</p>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x6307;&#x4EE4;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x6307;&#x4EE4;&#x4ECE;&#x7A0B;&#x5E8F;&#x6587;&#x672C;&#x5904;&#x8BFB;&#x53D6;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x666E;&#x901A;&#x7A0B;&#x5E8F;&#x4E2D;&#x51E0;&#x4E4E;&#x4E00;&#x534A;&#x7684;&#x6307;&#x4EE4;&#x90FD;&#x7528;&#x4E8E;&#x50A8;&#x5B58;&#x6216;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x95EE;&#x9898;&#xFF0C;&#x201C;&#x5185;&#x5B58;&#x74F6;&#x9888;&#x201D;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#x3002;</p>
<p>&#x5728;&#x5F53;&#x524D;&#x7684;&#x53F0;&#x5F0F;&#x673A;&#x4E0A;&#xFF0C;CPU&#x901A;&#x5E38;&#x4E3A;2GHz&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6BCF;0.5ns&#x5C31;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x6761;&#x65B0;&#x7684;&#x8BED;&#x53E5;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x7528;&#x4E8E;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x4F20;&#x9001;&#x6570;&#x636E;&#x7684;&#x65F6;&#x95F4;&#x7EA6;&#x4E3A;10ns&#x3002;&#x5982;&#x679C;CPU&#x9700;&#x8981;&#x7B49;10ns&#x6765;&#x6293;&#x53D6;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x518D;&#x7B49;10ns&#x6765;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x9700;&#x8981;40&#x4E2A;&#x65F6;&#x949F;&#x5468;&#x671F;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x3002;</p>
<h2 id="72-&#x7F13;&#x5B58;&#x6027;&#x80FD;">7.2 &#x7F13;&#x5B58;&#x6027;&#x80FD;</h2>
<p>&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x662F;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x662F;&#x7F13;&#x5B58;&#x3002;&#x201C;&#x7F13;&#x5B58;&#x201D;&#x662F;CPU&#x4E0A;&#x5C0F;&#x578B;&#x3001;&#x5FEB;&#x901F;&#x7684;&#x50A8;&#x5B58;&#x7A7A;&#x95F4;&#x3002;&#x5728;&#x5F53;&#x524D;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x50A8;&#x5B58;&#x901A;&#x5E38;&#x4E3A;1~2MiB&#xFF0C;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x4E3A;1~2ns&#x3002;</p>
<p>&#x5F53;CPU&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x4E00;&#x4EFD;&#x526F;&#x672C;&#x5B58;&#x5230;&#x7F13;&#x5B58;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;CPU&#x5C31;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x7F13;&#x5B58;&#xFF0C;&#x4E0D;&#x7528;&#x518D;&#x7B49;&#x5F85;&#x5185;&#x5B58;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x6700;&#x540E;&#x7F13;&#x5B58;&#x6EE1;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x8BA9;&#x65B0;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x6254;&#x6389;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;CPU&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x4E4B;&#x540E;&#xFF0C;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x518D;&#x6765;&#x8BFB;&#x53D6;&#xFF0C;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x80FD;&#x4E0D;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x4E86;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x53D7;&#x9650;&#x4E8E;&#x7F13;&#x5B58;&#x7684;&#x6548;&#x7387;&#x3002;&#x5982;&#x679C;CPU&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x901A;&#x5E38;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4EE5;CPU&#x7684;&#x5168;&#x901F;&#x6765;&#x8FD0;&#x884C;&#x3002;&#x5982;&#x679C;CPU&#x65F6;&#x5E38;&#x9700;&#x8981;&#x4E0D;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x53D7;&#x9650;&#x4E8E;&#x5185;&#x5B58;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x7F13;&#x5B58;&#x7684;&#x201C;&#x547D;&#x4E2D;&#x7387;&#x201D;<code>h</code>&#xFF0C;&#x662F;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x627E;&#x5230;&#x6570;&#x636E;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x201C;&#x7F3A;&#x5931;&#x7387;&#x201D;<code>m</code>&#xFF0C;&#x662F;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x65F6;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x5982;&#x679C;<code>Th</code>&#x662F;&#x5904;&#x7406;&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#xFF0C;<code>Tm</code>&#x662F;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6BCF;&#x6B21;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x662F;&#xFF1A;</p>
<pre><code>h * Th + m * Tm
</code></pre><p>&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x201C;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x201D;&#xFF0C;&#x5B83;&#x662F;&#x5904;&#x7406;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#x6240;&#x9700;&#x7684;&#x989D;&#x5916;&#x65F6;&#x95F4;&#xFF0C;<code>Tp = Tm - Th</code>&#xFF0C;&#x90A3;&#x4E48;&#x5E73;&#x5747;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x5C31;&#x662F;&#xFF1A;</p>
<pre><code>Th + m * Tp
</code></pre><p>&#x5F53;&#x7F3A;&#x5931;&#x7387;&#x5F88;&#x4F4E;&#x65F6;&#x5E73;&#x5747;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x8D8B;&#x8FD1;&#x4E8E;<code>Th</code>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8868;&#x73B0;&#x4E3A;&#x5185;&#x5B58;&#x5177;&#x6709;&#x7F13;&#x5B58;&#x7684;&#x901F;&#x5EA6;&#x90A3;&#x6837;&#x3002;</p>
<h2 id="73-&#x5C40;&#x90E8;&#x6027;">7.3 &#x5C40;&#x90E8;&#x6027;</h2>
<p>&#x5F53;&#x7A0B;&#x5E8F;&#x9996;&#x6B21;&#x8BFB;&#x53D6;&#x67D0;&#x4E2A;&#x5B57;&#x8282;&#x65F6;&#xFF0C;&#x7F13;&#x5B58;&#x901A;&#x5E38;&#x52A0;&#x8F7D;&#x4E00;&#x201C;&#x5757;&#x201D;&#x6216;&#x4E00;&#x201C;&#x884C;&#x201D;&#x6570;&#x636E;&#xFF0C;&#x5305;&#x542B;&#x6240;&#x9700;&#x7684;&#x5B57;&#x8282;&#x548C;&#x4E00;&#x4E9B;&#x76F8;&#x90BB;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x7EE7;&#x7EED;&#x8BFB;&#x53D6;&#x8FD9;&#x4E9B;&#x76F8;&#x90BB;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x5DF2;&#x7ECF;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x4E86;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x5757;&#x5927;&#x5C0F;&#x662F;64B&#xFF0C;&#x4F60;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;64&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x9996;&#x4E2A;&#x5B57;&#x8282;&#x6070;&#x597D;&#x5728;&#x5757;&#x7684;&#x5F00;&#x5934;&#x3002;&#x5F53;&#x4F60;&#x52A0;&#x8F7D;&#x9996;&#x4E2A;&#x5B57;&#x8282;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x89E6;&#x53D1;&#x4E86;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#xFF0C;&#x4F46;&#x662F;&#x4E4B;&#x540E;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x90FD;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#x3002;&#x5728;&#x8BFB;&#x53D6;&#x6574;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4E4B;&#x540E;&#xFF0C;&#x547D;&#x4E2D;&#x7387;&#x662F;63/64&#x3002;&#x5982;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x88AB;&#x5206;&#x5728;&#x4E24;&#x4E2A;&#x5757;&#x4E2D;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F1A;&#x89E6;&#x53D1;&#x4E24;&#x6B21;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x547D;&#x4E2D;&#x7387;&#x662F;62/64&#xFF0C;&#x7EA6;&#x4E3A;97%&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x5730;&#x8DF3;&#x6765;&#x8DF3;&#x53BB;&#xFF0C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x96F6;&#x6563;&#x7684;&#x4F4D;&#x7F6E;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5F88;&#x5C11;&#x4E24;&#x6B21;&#x8BBF;&#x95EE;&#x5230;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7F13;&#x5B58;&#x7684;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x5F88;&#x4F4E;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x6570;&#x636E;&#x591A;&#x4E8E;&#x4E00;&#x6B21;&#x7684;&#x503E;&#x5411;&#x53EB;&#x505A;&#x201C;&#x65F6;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x201D;&#x3002;&#x4F7F;&#x7528;&#x76F8;&#x90BB;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x636E;&#x7684;&#x503E;&#x5411;&#x53EB;&#x505A;&#x201C;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x201D;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5929;&#x751F;&#x5C31;&#x5E26;&#x6709;&#x8FD9;&#x4E24;&#x79CD;&#x5C40;&#x90E8;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x542B;&#x6709;&#x975E;&#x8DF3;&#x8F6C;&#x6216;&#x5206;&#x652F;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x6307;&#x4EE4;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;</li>
<li>&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x591A;&#x6B21;&#x76F8;&#x540C;&#x6307;&#x4EE4;&#xFF0C;&#x6240;&#x4EE5;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x65F6;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;</li>
<li>&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x7ED3;&#x679C;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x4E0B;&#x4E00;&#x6307;&#x4EE4;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x65F6;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;</li>
<li>&#x5F53;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x6808;&#x4E0A;&#x50A8;&#x5B58;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x8BBF;&#x95EE;&#x5177;&#x6709;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;</li>
<li>&#x6700;&#x666E;&#x904D;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x987A;&#x5E8F;&#x8BFB;&#x5199;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x3002;&#x8FD9;&#x4E00;&#x6A21;&#x5F0F;&#x4E5F;&#x5177;&#x6709;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;</li>
</ul>
<p>&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x63A2;&#x7D22;&#x7A0B;&#x5E8F;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x548C;&#x7F13;&#x5B58;&#x6027;&#x80FD;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<h2 id="74-&#x7F13;&#x5B58;&#x6027;&#x80FD;&#x7684;&#x5EA6;&#x91CF;">7.4 &#x7F13;&#x5B58;&#x6027;&#x80FD;&#x7684;&#x5EA6;&#x91CF;</h2>
<p>&#x5F53;&#x6211;&#x8FD8;&#x662F;UC&#x4F2F;&#x514B;&#x5229;&#x7684;&#x6BD5;&#x4E1A;&#x751F;&#x65F6;&#xFF0C;&#x6211;&#x662F;Brian Harvey&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x8BFE;&#x4E0A;&#x7684;&#x52A9;&#x6559;&#x3002;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x7EC3;&#x4E60;&#x4E4B;&#x4E00;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x6570;&#x7EC4;&#xFF0C;&#x8BFB;&#x5199;&#x5143;&#x7D20;&#x5E76;&#x5EA6;&#x91CF;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x6570;&#x7EC4;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x63A8;&#x6D4B;&#x51FA;&#x7F13;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5757;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x548C;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x6211;&#x7684;&#x8FD9;&#x4E00;&#x7A0B;&#x5E8F;&#x7684;&#x4FEE;&#x6539;&#x7248;&#x672C;&#x5728;&#x672C;&#x4E66;&#x4ED3;&#x5E93;&#x7684;<code>cache</code>&#x76EE;&#x5F55;&#x4E0B;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x7684;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x662F;&#x4E2A;&#x5FAA;&#x73AF;&#xFF1A;</p>
<pre><code class="lang-c">iters = <span class="hljs-number">0</span>;
<span class="hljs-keyword">do</span> {
    sec0 = get_seconds();

    <span class="hljs-keyword">for</span> (index = <span class="hljs-number">0</span>; index &lt; limit; index += stride) 
        <span class="hljs-built_in">array</span>[index] = <span class="hljs-built_in">array</span>[index] + <span class="hljs-number">1</span>;

    iters = iters + <span class="hljs-number">1</span>; 
    sec = sec + (get_seconds() - sec0);

} <span class="hljs-keyword">while</span> (sec &lt; <span class="hljs-number">0.1</span>);
</code></pre>
<p>&#x5185;&#x90E8;&#x7684;<code>for</code>&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x4E86;&#x6570;&#x7EC4;&#x3002;<code>limit</code>&#x51B3;&#x5B9A;&#x6570;&#x7EC4;&#x904D;&#x5386;&#x7684;&#x8303;&#x56F4;&#x3002;<code>stride</code>&#x51B3;&#x5B9A;&#x8DF3;&#x8FC7;&#x591A;&#x5C11;&#x5143;&#x7D20;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;<code>limit</code>&#x662F;16&#xFF0C;<code>stride</code>&#x662F;4&#xFF0C;&#x5FAA;&#x73AF;&#x5C31;&#x4F1A;&#x8BBF;&#x95EE;0&#x3001;4&#x3001;8&#x3001;&#x548C;12&#x3002;</p>
<p><code>sec</code>&#x8DDF;&#x8E2A;&#x4E86;CPU&#x7528;&#x4E8E;&#x5185;&#x5FAA;&#x73AF;&#x7684;&#x7684;&#x5168;&#x90E8;&#x65F6;&#x95F4;&#x3002;&#x5916;&#x90E8;&#x5FAA;&#x73AF;&#x76F4;&#x5230;<code>sec</code>&#x8D85;&#x8FC7;0.1&#x79D2;&#x624D;&#x4F1A;&#x505C;&#x6B62;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x51FA;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x6240;&#x9700;&#x7684;&#x7CBE;&#x786E;&#x5EA6;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x957F;&#x4E86;&#x3002;</p>
<p><code>get_seconds</code>&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;<code>clock_gettime</code>&#xFF0C;&#x5C06;&#x7ED3;&#x679C;&#x6362;&#x7B97;&#x6210;&#x79D2;&#xFF0C;&#x5E76;&#x4E14;&#x4EE5;<code>double</code>&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">double</span> <span class="hljs-title">get_seconds</span><span class="hljs-params">()</span></span>{
    <span class="hljs-keyword">struct</span> timespec ts;
    clock_gettime(CLOCK_PROCESS_CPUTIME_ID, &amp;ts);
    <span class="hljs-keyword">return</span> ts.tv_sec + ts.tv_nsec / <span class="hljs-number">1e9</span>;
}
</code></pre>
<p><img src="http://greenteapress.com/thinkos/html/thinkos001.png" alt=""></p>
<p>&#x56FE; 7.1&#xFF1A;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x548C;&#x6B65;&#x957F;&#x7684;&#x5E73;&#x5747;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x51FD;&#x6570;</p>
<p>&#x4E3A;&#x4E86;&#x5C06;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7684;&#x65F6;&#x95F4;&#x5206;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x5FAA;&#x73AF;&#xFF0C;&#x5B83;&#x9664;&#x4E86;&#x5185;&#x5FAA;&#x73AF;&#x4E0D;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x4E4B;&#x5916;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x5B83;&#x603B;&#x662F;&#x589E;&#x52A0;&#x76F8;&#x540C;&#x7684;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-c">iters2 = <span class="hljs-number">0</span>;
<span class="hljs-keyword">do</span> {
    sec0 = get_seconds();

    <span class="hljs-keyword">for</span> (index = <span class="hljs-number">0</span>; index &lt; limit; index += stride) 
        temp = temp + index;

    iters2 = iters2 + <span class="hljs-number">1</span>;
    sec = sec - (get_seconds() - sec0);

} <span class="hljs-keyword">while</span> (iters2 &lt; iters);
</code></pre>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x5FAA;&#x73AF;&#x8FD0;&#x884C;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x8FED;&#x4EE3;&#x3002;&#x5728;&#x6BCF;&#x8F6E;&#x8FED;&#x4EE3;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4ECE;<code>sec</code>&#x4E2D;&#x51CF;&#x5C11;&#x4E86;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5F53;&#x5FAA;&#x73AF;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;<code>sec</code>&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x6570;&#x7EC4;&#x8BBF;&#x95EE;&#x7684;&#x603B;&#x65F6;&#x95F4;&#xFF0C;&#x51CF;&#x53BB;&#x7528;&#x4E8E;&#x589E;&#x52A0;<code>temp</code>&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x5DEE;&#x5C31;&#x662F;&#x6240;&#x6709;&#x8BBF;&#x95EE;&#x89E6;&#x53D1;&#x7684;&#x5168;&#x90E8;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B83;&#x9664;&#x4EE5;&#x8BBF;&#x95EE;&#x603B;&#x6570;&#x6765;&#x83B7;&#x53D6;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x7684;&#x5E73;&#x5747;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#xFF0C;&#x4EE5;ns&#x4E3A;&#x5355;&#x4F4D;&#xFF1A;</p>
<pre><code>sec * 1e9 / iters / limit * stride
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;<code>cache.c</code>&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code>Size:    4096 Stride:       8 read+write: 0.8633 ns
Size:    4096 Stride:      16 read+write: 0.7023 ns
Size:    4096 Stride:      32 read+write: 0.7105 ns
Size:    4096 Stride:      64 read+write: 0.7058 ns
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x5B89;&#x88C5;&#x4E86;Python&#x548C;Matplotlib&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>graph_data.py</code>&#x6765;&#x4F7F;&#x7ED3;&#x679C;&#x53D8;&#x6210;&#x56FE;&#x5F62;&#x3002;&#x56FE;7.1&#x5C55;&#x793A;&#x4E86;&#x6211;&#x8FD0;&#x884C;&#x5728;Dell Optiplex 7010&#x4E0A;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x6570;&#x7EC4;&#x5927;&#x5C0F;&#x548C;&#x6B65;&#x957F;&#x4EE5;&#x5B57;&#x8282;&#x4E3A;&#x5355;&#x4F4D;&#x8868;&#x8FF0;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x82B1;&#x4E00;&#x5206;&#x949F;&#x6765;&#x8003;&#x8651;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x4E14;&#x770B;&#x770B;&#x4F60;&#x662F;&#x5426;&#x80FD;&#x63A8;&#x65AD;&#x51FA;&#x7F13;&#x5B58;&#x4FE1;&#x606F;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ul>
<li>&#x7A0B;&#x5E8F;&#x591A;&#x6B21;&#x904D;&#x5386;&#x5E76;&#x8BFB;&#x53D6;&#x6570;&#x7EC4;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;&#x5982;&#x679C;&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x80FD;&#x653E;&#x8FDB;&#x7F13;&#x5B58;&#xFF0C;&#x5E73;&#x5747;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x5E94;&#x51E0;&#x4E4E;&#x4E3A;0&#x3002;</li>
<li>&#x5F53;&#x6B65;&#x957F;&#x662F;4&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8BFB;&#x53D6;&#x4E86;&#x6570;&#x7EC4;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x7A0B;&#x5E8F;&#x6709;&#x5927;&#x91CF;&#x7684;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5757;&#x5927;&#x5C0F;&#x8DB3;&#x4EE5;&#x5305;&#x542B;64&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5373;&#x4F7F;&#x6570;&#x7EC4;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x653E;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x547D;&#x4E2D;&#x7387;&#x5E94;&#x4E3A;63/64&#x3002;</li>
<li>&#x5982;&#x679C;&#x6B65;&#x957F;&#x7B49;&#x4E8E;&#x5757;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x6216;&#x66F4;&#x5927;&#xFF09;&#xFF0C;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#x5E94;&#x4E3A;0&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x6211;&#x4EEC;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x6700;&#x5927;&#x7684;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x3002;</li>
</ul>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x7EC4;&#x6BD4;&#x7F13;&#x5B58;&#x5927;&#x5C0F;&#x66F4;&#x5C0F;&#xFF0C;&#x6216;&#x6B65;&#x957F;&#x5C0F;&#x4E8E;&#x5757;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4F1A;&#x6709;&#x826F;&#x597D;&#x7684;&#x7F13;&#x5B58;&#x6027;&#x80FD;&#x3002;&#x5982;&#x679C;&#x6570;&#x7EC4;&#x5927;&#x4E8E;&#x7F13;&#x5B58;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x4E14;&#x6B65;&#x957F;&#x8F83;&#x5927;&#x65F6;&#xFF0C;&#x6027;&#x80FD;&#x53EA;&#x4F1A;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#x5728;&#x56FE;7.1&#x4E2D;&#xFF0C;&#x53EA;&#x8981;&#x6570;&#x7EC4;&#x5C0F;&#x4E8E;<code>2 ** 22</code>&#x5B57;&#x8282;&#xFF0C;&#x7F13;&#x5B58;&#x6027;&#x80FD;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x6B65;&#x957F;&#x90FD;&#x5F88;&#x597D;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63A8;&#x6D4B;&#x7F13;&#x5B58;&#x5927;&#x5C0F;&#x8FD1;&#x4F3C;4MiB&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6839;&#x636E;&#x89C4;&#x8303;&#x5E94;&#x8BE5;&#x662F;3MiB&#x3002;</p>
<p>&#x5F53;&#x6B65;&#x957F;&#x4E3A;8&#x3001;16&#x6216;32B&#x65F6;&#xFF0C;&#x7F13;&#x5B58;&#x6027;&#x80FD;&#x826F;&#x597D;&#x3002;&#x5728;64B&#x65F6;&#x5F00;&#x59CB;&#x4E0B;&#x964D;&#xFF0C;&#x5BF9;&#x4E8E;&#x66F4;&#x5927;&#x7684;&#x6B65;&#x957F;&#xFF0C;&#x5E73;&#x5747;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x7EA6;&#x4E3A;9ns&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63A8;&#x65AD;&#x51FA;&#x5757;&#x5927;&#x5C0F;&#x4E3A;128B&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x5904;&#x7406;&#x5668;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x201C;&#x591A;&#x7EA7;&#x7F13;&#x5B58;&#x201D;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x5FEB;&#x901F;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x6162;&#x901F;&#x7684;&#x7F13;&#x5B58;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5F53;&#x6570;&#x7EC4;&#x5927;&#x5C0F;&#x5927;&#x4E8E;<code>2 ** 14</code>B&#x65F6;&#xFF0C;&#x7F3A;&#x5931;&#x60E9;&#x7F5A;&#x4F3C;&#x4E4E;&#x589E;&#x957F;&#x4E86;&#x4E00;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x53EF;&#x80FD;&#x4E5F;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;1ns&#x7684;16KB&#x7F13;&#x5B58;&#x3002;</p>
<h2 id="75-&#x7F13;&#x5B58;&#x53CB;&#x597D;&#x7684;&#x7F16;&#x7A0B;">7.5 &#x7F13;&#x5B58;&#x53CB;&#x597D;&#x7684;&#x7F16;&#x7A0B;</h2>
<p>&#x5185;&#x5B58;&#x7684;&#x7F13;&#x5B58;&#x529F;&#x80FD;&#x7531;&#x786C;&#x4EF6;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x592A;&#x591A;&#x5173;&#x4E8E;&#x5B83;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x7F13;&#x5B58;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x66F4;&#x6709;&#x6548;&#x5229;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x6570;&#x7EC4;&#xFF0C;&#x53EA;&#x904D;&#x5386;&#x6570;&#x7EC4;&#x4E00;&#x6B21;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x4E0A;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x53EF;&#x80FD;&#x6BD4;&#x904D;&#x5386;&#x6570;&#x7EC4;&#x591A;&#x6B21;&#x8981;&#x5FEB;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5904;&#x7406;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;&#xFF0C;&#x5B83;&#x4EE5;&#x884C;&#x6570;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;&#x50A8;&#x5B58;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x904D;&#x5386;&#x5143;&#x7D20;&#xFF0C;&#x6309;&#x884C;&#x904D;&#x5386;&#x5E76;&#x4E14;&#x6B65;&#x957F;&#x4E3A;&#x5143;&#x7D20;&#x5927;&#x5C0F;&#x4F1A;&#x6BD4;&#x6309;&#x5217;&#x904D;&#x5386;&#x5E76;&#x4E14;&#x6B65;&#x957F;&#x4E3A;&#x884C;&#x7684;&#x5927;&#x5C0F;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x94FE;&#x8868;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E76;&#x4E0D;&#x603B;&#x5177;&#x6709;&#x7A7A;&#x95F4;&#x5C40;&#x90E8;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x8282;&#x70B9;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x540C;&#x65F6;&#x5206;&#x914D;&#x4E86;&#x5F88;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5806;&#x4E2D;&#x901A;&#x5E38;&#x5206;&#x914D;&#x5230;&#x4E00;&#x8D77;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E00;&#x6B21;&#x5206;&#x914D;&#x4E86;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6570;&#x7EC4;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x7684;&#x9012;&#x5F52;&#x7B56;&#x7565;&#x901A;&#x5E38;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5C06;&#x5927;&#x6570;&#x7EC4;&#x5212;&#x5206;&#x4E3A;&#x5C0F;&#x7247;&#x6BB5;&#xFF0C;&#x4E4B;&#x540E;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x5C0F;&#x7247;&#x6BB5;&#x3002;&#x6709;&#x65F6;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x8C03;&#x4F18;&#x6765;&#x5229;&#x7528;&#x7F13;&#x5B58;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x6027;&#x80FD;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x9002;&#x914D;&#x7F13;&#x5B58;&#x5927;&#x5C0F;&#x3001;&#x5757;&#x5927;&#x5C0F;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x786C;&#x4EF6;&#x7279;&#x5F81;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x53EB;&#x505A;&#x201C;&#x7F13;&#x5B58;&#x611F;&#x77E5;&#x201D;&#x3002;&#x7F13;&#x5B58;&#x611F;&#x77E5;&#x7B97;&#x6CD5;&#x7684;&#x660E;&#x663E;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x5B83;&#x4EEC;&#x786C;&#x4EF6;&#x7279;&#x5B9A;&#x7684;&#x3002;</p>
<h2 id="76-&#x5B58;&#x50A8;&#x5668;&#x5C42;&#x6B21;&#x7ED3;&#x6784;">7.6 &#x5B58;&#x50A8;&#x5668;&#x5C42;&#x6B21;&#x7ED3;&#x6784;</h2>
<p>&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x7684;&#x51E0;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x5982;&#x679C;&#x7F13;&#x5B58;&#x6BD4;&#x4E3B;&#x5B58;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4F7F;&#x7528;&#x4E00;&#x5927;&#x5757;&#x7F13;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x4E3B;&#x5B58;&#x6254;&#x6389;&#x5462;&#xFF1F;&#x201D;</p>
<p>&#x5728;&#x6CA1;&#x6709;&#x6DF1;&#x5165;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E4B;&#x524D;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;&#x7535;&#x5B50;&#x548C;&#x7ECF;&#x6D4E;&#x5B66;&#x4E0A;&#x7684;&#x3002;&#x7F13;&#x5B58;&#x5F88;&#x5FEB;&#x662F;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x5F88;&#x5C0F;&#xFF0C;&#x5E76;&#x4E14;&#x79BB;CPU&#x5F88;&#x8FD1;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x7531;&#x4E8E;&#x7535;&#x5BB9;&#x9020;&#x6210;&#x7684;&#x5EF6;&#x8FDF;&#x548C;&#x4FE1;&#x53F7;&#x4F20;&#x64AD;&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;&#x7F13;&#x5B58;&#x505A;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x5B83;&#x5C31;&#x53D8;&#x5F97;&#x5F88;&#x6162;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7F13;&#x5B58;&#x5360;&#x636E;&#x5904;&#x7406;&#x5668;&#x82AF;&#x7247;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x66F4;&#x5927;&#x7684;&#x5904;&#x7406;&#x5668;&#x4F1A;&#x66F4;&#x8D35;&#x3002;&#x4E3B;&#x5B58;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF08;DRAM&#xFF09;&#xFF0C;&#x6BCF;&#x4F4D;&#x4E0A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6676;&#x4F53;&#x7BA1;&#x548C;&#x4E00;&#x4E2A;&#x7535;&#x5BB9;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x66F4;&#x591A;&#x5185;&#x5B58;&#x6253;&#x5305;&#x5728;&#x540C;&#x4E00;&#x7A7A;&#x95F4;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x5185;&#x5B58;&#x7684;&#x65B9;&#x6CD5;&#x8981;&#x6BD4;&#x7F13;&#x5B58;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x5F0F;&#x66F4;&#x6162;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x4E3B;&#x5B58;&#x901A;&#x5E38;&#x5305;&#x88C5;&#x5728;&#x53CC;&#x5217;&#x76F4;&#x63D2;&#x5F0F;&#x5185;&#x5B58;&#x6A21;&#x5757;&#xFF08;DIMM&#xFF09;&#x4E2D;&#xFF0C;&#x5B83;&#x81F3;&#x5C11;&#x5305;&#x542B;16&#x4E2A;&#x82AF;&#x7247;&#x3002;&#x51E0;&#x4E2A;&#x5C0F;&#x578B;&#x82AF;&#x7247;&#x6BD4;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x82AF;&#x7247;&#x66F4;&#x4FBF;&#x5B9C;&#x3002;</p>
<p>&#x901F;&#x5EA6;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x6210;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x8861;&#x662F;&#x7F13;&#x5B58;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x6709;&#x65E2;&#x5FEB;&#x53C8;&#x5927;&#x8FD8;&#x4FBF;&#x5B9C;&#x7684;&#x5185;&#x5B58;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#x4E86;&#x3002;</p>
<p>&#x4E0E;&#x5185;&#x5B58;&#x76F8;&#x540C;&#x7684;&#x539F;&#x5219;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5668;&#x3002;&#x95EA;&#x5B58;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x6BD4;&#x786C;&#x76D8;&#x66F4;&#x8D35;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5C31;&#x66F4;&#x5C0F;&#x3002;&#x78C1;&#x5E26;&#x6BD4;&#x786C;&#x76D8;&#x66F4;&#x6162;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;&#x66F4;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x76F8;&#x5BF9;&#x8F83;&#x4FBF;&#x5B9C;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x8868;&#x683C;&#x5C55;&#x793A;&#x4E86;&#x6BCF;&#x79CD;&#x6280;&#x672F;&#x901A;&#x5E38;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x6210;&#x672C;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x8BBE;&#x5907;</th>
<th>&#x8BBF;&#x95EE;&#x65F6;&#x95F4;</th>
<th>&#x901A;&#x5E38;&#x5927;&#x5C0F;</th>
<th>&#x6210;&#x672C;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x5BC4;&#x5B58;&#x5668;</td>
<td>0.5 ns</td>
<td>256 B</td>
<td>?</td>
</tr>
<tr>
<td>&#x7F13;&#x5B58;</td>
<td>1 ns</td>
<td>2 MiB</td>
<td>?</td>
</tr>
<tr>
<td>DRAM</td>
<td>10 ns</td>
<td>4 GiB</td>
<td>$10 / GiB</td>
</tr>
<tr>
<td>SSD</td>
<td>10 &#xB5;s</td>
<td>100 GiB</td>
<td>$1 / GiB</td>
</tr>
<tr>
<td>HDD</td>
<td>5 ms</td>
<td>500 GiB</td>
<td>$0.25 / GiB</td>
</tr>
<tr>
<td>&#x78C1;&#x5E26;</td>
<td>minutes</td>
<td>1&#x2013;2 TiB</td>
<td>$0.02 / GiB</td>
</tr>
</tbody>
</table>
<p>&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x6570;&#x91CF;&#x548C;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5F53;&#x524D;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x62E5;&#x6709;32&#x4E2A;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;&#x4E00;&#x4E2A;&#x201C;&#x5B57;&#x201D;&#x3002;&#x5728;32&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x4E3A;32&#x4F4D;&#xFF0C;4&#x4E2A;&#x5B57;&#x8282;&#x3002;64&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x4E3A;64&#x4F4D;&#xFF0C;8&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x6240;&#x4EE5;&#x5BC4;&#x5B58;&#x5668;&#x6587;&#x4EF6;&#x7684;&#x603B;&#x5BB9;&#x91CF;&#x662F;100~300&#x5B57;&#x8282;&#x3002;</p>
<p>&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x7F13;&#x5B58;&#x7684;&#x6210;&#x672C;&#x5F88;&#x96BE;&#x8861;&#x91CF;&#x3002;&#x5B83;&#x4EEC;&#x5305;&#x542B;&#x5728;&#x82AF;&#x7247;&#x7684;&#x6210;&#x672C;&#x4E2D;&#x3002;&#x4F46;&#x662F;&#x987E;&#x5BA2;&#x5E76;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x4E86;&#x89E3;&#x5230;&#x5176;&#x6210;&#x672C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8868;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x89C2;&#x5BDF;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x7EBF;&#x5546;&#x5E97;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x5F85;&#x552E;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x89C4;&#x683C;&#x3002;&#x622A;&#x81F3;&#x4F60;&#x8BFB;&#x5230;&#x8FD9;&#x91CC;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5E26;&#x7ED9;&#x4F60;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x6027;&#x80FD;&#x548C;&#x6210;&#x672C;&#x5DEE;&#x8DDD;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x6784;&#x6210;&#x4E86;&#x201C;&#x5B58;&#x50A8;&#x5668;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x201D;&#x3002;&#x7ED3;&#x6784;&#x4E2D;&#x6BCF;&#x4E00;&#x7EA7;&#x90FD;&#x6BD4;&#x5B83;&#x4E0A;&#x4E00;&#x7EA7;&#x5927;&#x800C;&#x7F13;&#x6162;&#x3002;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E00;&#x7EA7;&#x90FD;&#x4F5C;&#x4E3A;&#x5176;&#x4E0B;&#x4E00;&#x7EA7;&#x7684;&#x7F13;&#x5B58;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x4E3B;&#x5B58;&#x662F;&#x6301;&#x4E45;&#x5316;&#x50A8;&#x5B58;&#x5728;SSD&#x6216;HDD&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x7684;&#x7F13;&#x5B58;&#x3002;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x5904;&#x7406;&#x78C1;&#x5E26;&#x4E0A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x786C;&#x76D8;&#x7F13;&#x5B58;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#x3002;</p>
<h2 id="77-&#x7F13;&#x5B58;&#x7B56;&#x7565;">7.7 &#x7F13;&#x5B58;&#x7B56;&#x7565;</h2>
<p>&#x5B58;&#x50A8;&#x5668;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x8003;&#x8651;&#x5230;&#x7F13;&#x5B58;&#x7684;&#x6846;&#x67B6;&#x3002;&#x5728;&#x7ED3;&#x6784;&#x7684;&#x6BCF;&#x4E00;&#x7EA7;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x56DB;&#x4E2A;&#x7F13;&#x5B58;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x8C01;&#x5728;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x4E0A;&#x79FB;&#x6216;&#x4E0B;&#x79FB;&#x6570;&#x636E;&#xFF1F;&#x5728;&#x7ED3;&#x6784;&#x7684;&#x9876;&#x7AEF;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x901A;&#x5E38;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x5B8C;&#x6210;&#x5206;&#x914D;&#x3002;CPU&#x4E0A;&#x7684;&#x786C;&#x4EF6;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x7684;&#x7F13;&#x5B58;&#x3002;&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x6216;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5C06;&#x5B58;&#x50A8;&#x5668;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x9690;&#x5F0F;&#x79FB;&#x52A8;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x4F46;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E5F;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x5185;&#x5B58;&#x79FB;&#x52A8;&#x56DE;&#x5B58;&#x50A8;&#x5668;&#x3002;&#x5728;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x5E95;&#x7AEF;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x5728;&#x78C1;&#x5E26;&#x548C;&#x78C1;&#x76D8;&#x4E4B;&#x95F4;&#x663E;&#x5F0F;&#x79FB;&#x52A8;&#x6570;&#x636E;&#x3002;</li>
<li>&#x79FB;&#x52A8;&#x4E86;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF1F;&#x901A;&#x5E38;&#xFF0C;&#x5728;&#x7ED3;&#x6784;&#x9876;&#x7AEF;&#x7684;&#x5757;&#x5927;&#x5C0F;&#x6BD4;&#x5E95;&#x7AEF;&#x8981;&#x5C0F;&#x3002;&#x5728;&#x5185;&#x5B58;&#x7684;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x5757;&#x5927;&#x5C0F;&#x4E3A;128B&#x3002;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x9875;&#x9762;&#x53EF;&#x80FD;&#x4E3A;4KiB&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x6B21;&#x8BFB;10&#x6216;100&#x4E2A;&#x5757;&#x3002;</li>
<li>&#x6570;&#x636E;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4F1A;&#x79FB;&#x52A8;&#xFF1F;&#x5728;&#x591A;&#x6570;&#x7684;&#x57FA;&#x672C;&#x7684;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x5728;&#x9996;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#x4F1A;&#x79FB;&#x5230;&#x7F13;&#x5B58;&#x3002;&#x4F46;&#x662F;&#x8BB8;&#x591A;&#x7F13;&#x5B58;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x201C;&#x9884;&#x53D6;&#x201D;&#x673A;&#x5236;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6570;&#x636E;&#x4F1A;&#x5728;&#x663E;&#x5F0F;&#x8BF7;&#x6C42;&#x4E4B;&#x524D;&#x52A0;&#x8F7D;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x9884;&#x53D6;&#x7684;&#x4E00;&#x4E9B;&#x5F62;&#x5F0F;&#x4E86;&#xFF1A;&#x5728;&#x8BF7;&#x6C42;&#x5176;&#x4E00;&#x90E8;&#x5206;&#x65F6;&#x52A0;&#x8F7D;&#x6574;&#x4E2A;&#x5757;&#x3002;</li>
<li>&#x7F13;&#x5B58;&#x4E2D;&#x6570;&#x636E;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF1F;&#x5F53;&#x7F13;&#x5B58;&#x586B;&#x6EE1;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x628A;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x6254;&#x6389;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x653E;&#x8FDB;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x7406;&#x60F3;&#x5316;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x4FDD;&#x7559;&#x5C06;&#x8981;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x66FF;&#x6362;&#x6389;&#x4E0D;&#x4F1A;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x6784;&#x6210;&#x4E86;&#x201C;&#x7F13;&#x5B58;&#x7B56;&#x7565;&#x201D;&#x3002;&#x5728;&#x9760;&#x8FD1;&#x9876;&#x7AEF;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7F13;&#x5B58;&#x7B56;&#x7565;&#x503E;&#x5411;&#x4E8E;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x5E76;&#x7531;&#x786C;&#x4EF6;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x9760;&#x8FD1;&#x5E95;&#x7AEF;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x505A;&#x51B3;&#x5B9A;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x7B56;&#x7565;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x591A;&#x6570;&#x7F13;&#x5B58;&#x7B56;&#x7565;&#x57FA;&#x4E8E;&#x5386;&#x53F2;&#x91CD;&#x6F14;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x6700;&#x8FD1;&#x65F6;&#x671F;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x9884;&#x6D4B;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x5757;&#x6570;&#x636E;&#x5728;&#x6700;&#x8FD1;&#x4F7F;&#x7528;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5B83;&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#x4F1A;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x505A;&#x201C;&#x6700;&#x8FD1;&#x6700;&#x5C11;&#x4F7F;&#x7528;&#x201D;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5373;LRU&#x3002;&#x5B83;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x79FB;&#x9664;&#x6700;&#x4E45;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x5757;&#x3002;&#x66F4;&#x591A;&#x8BDD;&#x9898;&#x8BF7;&#x89C1;<a href="http://en.wikipedia.org/wiki/Cache_algorithms" target="_blank">&#x7F13;&#x5B58;&#x7B97;&#x6CD5;&#x7684;&#x7EF4;&#x57FA;&#x767E;&#x79D1;</a>&#x3002;</p>
<h2 id="78-&#x9875;&#x9762;&#x8C03;&#x5EA6;">7.8 &#x9875;&#x9762;&#x8C03;&#x5EA6;</h2>
<p>&#x5728;&#x5E26;&#x6709;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5C06;&#x9875;&#x9762;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x548C;&#x5185;&#x5B58;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#x3002;&#x50CF;&#x6211;&#x5728;6.2&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x53EB;&#x505A;&#x201C;&#x9875;&#x9762;&#x8C03;&#x5EA6;&#x201D;&#xFF0C;&#x6216;&#x8005;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x53EB;&#x201C;&#x6362;&#x9875;&#x201D;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF1A;</p>
<ol>
<li>&#x8FDB;&#x7A0B;A&#x8C03;&#x7528;<code>malloc</code>&#x6765;&#x5206;&#x914D;&#x9875;&#x9762;&#x3002;&#x5982;&#x679C;&#x5806;&#x4E2D;&#x6CA1;&#x6709;&#x6240;&#x8BF7;&#x6C42;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F2;&#x7A7A;&#x95F4;&#xFF0C;<code>malloc</code>&#x4F1A;&#x8C03;&#x7528;<code>sbrk</code>&#x5411;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x66F4;&#x591A;&#x5185;&#x5B58;&#x3002;</li>
<li>&#x5982;&#x679C;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x6709;&#x7A7A;&#x95F2;&#x9875;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5C06;&#x5176;&#x52A0;&#x8F7D;&#x5230;&#x8FDB;&#x7A0B;A&#x7684;&#x9875;&#x8868;&#xFF0C;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6709;&#x6548;&#x8303;&#x56F4;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x9875;&#x9762;&#xFF0C;&#x8C03;&#x5EA6;&#x7CFB;&#x7EDF;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x8FDB;&#x7A0B;B&#x7684;&#x201C;&#x727A;&#x7272;&#x9875;&#x9762;&#x201D;&#x3002;&#x5B83;&#x5C06;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x4ECE;&#x5185;&#x5B58;&#x590D;&#x5236;&#x5230;&#x78C1;&#x76D8;&#xFF0C;&#x4E4B;&#x540E;&#x4FEE;&#x6539;&#x8FDB;&#x7A0B;B&#x7684;&#x9875;&#x8868;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x201C;&#x88AB;&#x6362;&#x51FA;&#x201D;&#x4E86;&#x3002;</li>
<li>&#x4E00;&#x65E6;&#x8FDB;&#x7A0B;B&#x7684;&#x6570;&#x636E;&#x88AB;&#x5199;&#x5165;&#xFF0C;&#x9875;&#x9762;&#x4F1A;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x7ED9;&#x8FDB;&#x7A0B;A&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FDB;&#x7A0B;A&#x8BFB;&#x53D6;&#x8FDB;&#x7A0B;B&#x7684;&#x6570;&#x636E;&#xFF0C;&#x9875;&#x9762;&#x5E94;&#x88AB;&#x6E05;&#x7A7A;&#x3002;</li>
<li>&#x6B64;&#x65F6;<code>sbrk</code>&#x7684;&#x8C03;&#x7528;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x4E86;&#xFF0C;&#x5411;<code>malloc</code>&#x63D0;&#x4F9B;&#x5806;&#x533A;&#x989D;&#x5916;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x4E4B;&#x540E;<code>malloc</code>&#x5206;&#x914D;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x5185;&#x5B58;&#x5E76;&#x8FD4;&#x56DE;&#x3002;&#x8FDB;&#x7A0B;A&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</li>
<li>&#x5F53;&#x8FDB;&#x7A0B;A&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x6216;&#x4E2D;&#x65AD;&#x540E;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x8FDB;&#x7A0B;B&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x5F53;&#x5B83;&#x8BBF;&#x95EE;&#x5230;&#x88AB;&#x6362;&#x51FA;&#x7684;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5668;&#x5355;&#x5143;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x662F;&#x201C;&#x65E0;&#x6548;&#x201D;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x89E6;&#x53D1;&#x4E2D;&#x65AD;&#x3002;</li>
<li>&#x5F53;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x4E2D;&#x65AD;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x770B;&#x5230;&#x9875;&#x9762;&#x88AB;&#x6362;&#x51FA;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x5B83;&#x5C06;&#x9875;&#x9762;&#x4ECE;&#x78C1;&#x76D8;&#x4F20;&#x9001;&#x5230;&#x5185;&#x5B58;&#x3002;</li>
<li>&#x4E00;&#x65E6;&#x9875;&#x9762;&#x88AB;&#x6362;&#x5165;&#x4E4B;&#x540E;&#xFF0C;&#x8FDB;&#x7A0B;B&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</li>
</ol>
<p>&#x5F53;&#x9875;&#x9762;&#x8C03;&#x5EA6;&#x5DE5;&#x4F5C;&#x826F;&#x597D;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x63D0;&#x5347;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5229;&#x7528;&#x6C34;&#x5E73;&#xFF0C;&#x5141;&#x8BB8;&#x66F4;&#x591A;&#x8FDB;&#x7A0B;&#x5728;&#x66F4;&#x5C11;&#x7684;&#x7A7A;&#x95F4;&#x5185;&#x6267;&#x884C;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5B83;&#x7684;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li>&#x5927;&#x591A;&#x6570;&#x8FDB;&#x7A0B;&#x4E0D;&#x4F1A;&#x7528;&#x5B8C;&#x6240;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x3002;<code>text</code>&#x6BB5;&#x7684;&#x8BB8;&#x591A;&#x90E8;&#x5206;&#x90FD;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x5C31;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x9875;&#x9762;&#x53EF;&#x4EE5;&#x88AB;&#x6362;&#x51FA;&#x800C;&#x4E0D;&#x4F1A;&#x5F15;&#x53D1;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x6CC4;&#x9732;&#x4E86;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x6389;&#x6240;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x5B83;&#x4E86;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x8FD9;&#x4E9B;&#x9875;&#x9762;&#x6362;&#x51FA;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x586B;&#x8865;&#x6CC4;&#x9732;&#x3002;</li>
<li>&#x5728;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6709;&#x4E9B;&#x8FDB;&#x7A0B;&#x50CF;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x90A3;&#x6837;&#xFF0C;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x4E0B;&#x90FD;&#x662F;&#x95F2;&#x7F6E;&#x7684;&#xFF0C;&#x53EA;&#x5728;&#x7279;&#x5B9A;&#x573A;&#x5408;&#x88AB;&#x201C;&#x5524;&#x9192;&#x201D;&#x6765;&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#x3002;&#x5F53;&#x5B83;&#x4EEC;&#x95F2;&#x7F6E;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x88AB;&#x6362;&#x51FA;&#x3002;</li>
<li>&#x53E6;&#x5916;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x8BB8;&#x591A;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x540C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;<code>text</code>&#x6BB5;&#xFF0C;&#x907F;&#x514D;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x7559;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x4F60;&#x589E;&#x52A0;&#x5206;&#x914D;&#x7ED9;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x603B;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8D85;&#x51FA;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x4E14;&#x7CFB;&#x7EDF;&#x4ECD;&#x65E7;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x5F53;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x88AB;&#x6362;&#x51FA;&#x7684;&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4ECE;&#x78C1;&#x76D8;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4F1A;&#x82B1;&#x8D39;&#x51E0;&#x4E2A;&#x6BEB;&#x79D2;&#x3002;&#x8FD9;&#x4E00;&#x5EF6;&#x8FDF;&#x901A;&#x5E38;&#x5F88;&#x660E;&#x663E;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x95F2;&#x7F6E;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4E4B;&#x540E;&#x5207;&#x6362;&#x56DE;&#x5B83;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x6267;&#x884C;&#x5F97;&#x6BD4;&#x8F83;&#x6162;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x9875;&#x9762;&#x6362;&#x5165;&#x65F6;&#x4F1A;&#x542C;&#x5230;&#x78C1;&#x76D8;&#x5DE5;&#x4F5C;&#x7684;&#x58F0;&#x97F3;&#x3002;</p>
<p>&#x50CF;&#x8FD9;&#x6837;&#x5076;&#x5C14;&#x7684;&#x5EF6;&#x8FDF;&#x53EF;&#x80FD;&#x8FD8;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x5360;&#x636E;&#x5927;&#x91CF;&#x7A7A;&#x95F4;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x4F1A;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x3002;&#x5F53;&#x8FDB;&#x7A0B;A&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x6536;&#x56DE;&#x8FDB;&#x7A0B;B&#x6240;&#x9700;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x4E4B;&#x540E;&#x8FDB;&#x7A0B;B&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x53C8;&#x4F1A;&#x6536;&#x56DE;&#x8FDB;&#x7A0B;A&#x6240;&#x9700;&#x7684;&#x9875;&#x9762;&#x3002;&#x5F53;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x4F1A;&#x6267;&#x884C;&#x7F13;&#x6162;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x53D8;&#x5F97;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x79CD;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x770B;&#x5230;&#x7684;&#x573A;&#x666F;&#x53EB;&#x505A;&#x201C;&#x98A0;&#x7C38;&#x201D;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x68C0;&#x6D4B;&#x8C03;&#x5EA6;&#x548C;&#x5757;&#x4E0A;&#x7684;&#x589E;&#x957F;&#x6765;&#x907F;&#x514D;&#x98A0;&#x7C38;&#xFF0C;&#x6216;&#x8005;&#x6740;&#x6389;&#x8FDB;&#x7A0B;&#x76F4;&#x5230;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x518D;&#x6B21;&#x54CD;&#x5E94;&#x3002;&#x4F46;&#x662F;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x90FD;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x6216;&#x8005;&#x505A;&#x5F97;&#x4E0D;&#x597D;&#x3002;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x8BA9;&#x7528;&#x6237;&#x53BB;&#x9650;&#x5236;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x5C1D;&#x8BD5;&#x5728;&#x98A0;&#x7C38;&#x53D1;&#x751F;&#x65F6;&#x6062;&#x590D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch6.html" class="navigation navigation-prev " aria-label="Previous page: 第六章 内存管理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch8.html" class="navigation navigation-next " aria-label="Next page: 第八章 多任务">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第七章 缓存","level":"1.9","depth":1,"next":{"title":"第八章 多任务","level":"1.10","depth":1,"path":"ch8.md","ref":"ch8.md","articles":[]},"previous":{"title":"第六章 内存管理","level":"1.8","depth":1,"path":"ch6.md","ref":"ch6.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch7.md","mtime":"2018-01-28T13:50:43.817Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-01-28T13:55:30.349Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

