
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第八章 多任务 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch9.html" />
    
    
    <link rel="prev" href="ch7.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    操作系统思考 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch0.html">
            
                <a href="ch0.html">
            
                    
                    第零章 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 进程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 虚拟内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 文件和文件系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 更多的位与字节
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 缓存
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 多任务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章 线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章 条件变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章 C语言中的信号量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="donors.html">
            
                <a href="donors.html">
            
                    
                    捐赠名单
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第八章 多任务</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x516B;&#x7AE0;-&#x591A;&#x4EFB;&#x52A1;">&#x7B2C;&#x516B;&#x7AE0; &#x591A;&#x4EFB;&#x52A1;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;<a href="http://greenteapress.com/wp/" target="_blank">Allen B. Downey</a></p>
<p>&#x539F;&#x6587;&#xFF1A;<a href="http://greenteapress.com/thinkos/html/thinkos009.html" target="_blank">Chapter 8  Multitasking</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<p>&#x5728;&#x5F53;&#x524D;&#x7684;&#x8BB8;&#x591A;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;CPU&#x5305;&#x542B;&#x591A;&#x4E2A;&#x6838;&#x5FC3;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x90FD;&#x5177;&#x6709;&#x201C;&#x591A;&#x4EFB;&#x52A1;&#x201D;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5FEB;&#x901F;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x521B;&#x9020;&#x51FA;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x8BB8;&#x591A;&#x8FDB;&#x7A0B;&#x7684;&#x5E7B;&#x8C61;&#x3002;</p>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#x53EB;&#x505A;&#x201C;&#x5185;&#x6838;&#x201D;&#x3002;&#x5728;&#x575A;&#x679C;&#x6216;&#x8005;&#x79CD;&#x5B50;&#x4E2D;&#xFF0C;&#x5185;&#x6838;&#x662F;&#x6700;&#x5185;&#x5C42;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x7531;&#x5916;&#x58F3;&#x6240;&#x5305;&#x56F4;&#x3002;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5404;&#x79CD;&#xFF0C;&#x5185;&#x6838;&#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x6700;&#x5E95;&#x5C42;&#xFF0C;&#x7531;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x5C42;&#x5305;&#x56F4;&#xFF0C;&#x5305;&#x62EC;&#x79F0;&#x4E3A;&#x201C;Shell&#x201D;&#x7684;&#x754C;&#x9762;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x559C;&#x6B22;&#x5F15;&#x55BB;&#x3002;</p>
<p>&#x7A76;&#x5176;&#x672C;&#x8D28;&#xFF0C;&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5904;&#x7406;&#x4E2D;&#x65AD;&#x3002;&#x201C;&#x4E2D;&#x65AD;&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x5B83;&#x4F1A;&#x505C;&#x6B62;&#x901A;&#x5E38;&#x7684;&#x6307;&#x4EE4;&#x5468;&#x671F;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x6267;&#x884C;&#x6D41;&#x8DF3;&#x5230;&#x79F0;&#x4E3A;&#x201C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x201D;&#x7684;&#x7279;&#x6B8A;&#x4EE3;&#x7801;&#x533A;&#x57DF;&#x5185;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x5411;CPU&#x53D1;&#x9001;&#x4FE1;&#x53F7;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x786C;&#x4EF6;&#x4E2D;&#x65AD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x53EF;&#x80FD;&#x5728;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x65F6;&#x4F1A;&#x4EA7;&#x751F;&#x4E2D;&#x65AD;&#xFF0C;&#x6216;&#x8005;&#x78C1;&#x76D8;&#x9A71;&#x52A8;&#x5668;&#x4F1A;&#x5728;&#x6570;&#x636E;&#x4F20;&#x9001;&#x5B8C;&#x6210;&#x65F6;&#x4EA7;&#x751F;&#x4E2D;&#x65AD;&#x3002;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E5F;&#x5E26;&#x6709;&#x4EE5;&#x56FA;&#x5B9A;&#x5468;&#x671F;&#x4EA7;&#x751F;&#x4E2D;&#x65AD;&#x7684;&#x8BA1;&#x65F6;&#x5668;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x4E2D;&#x65AD;&#x7531;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x6240;&#x4EA7;&#x751F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7531;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#x4E2D;&#x65AD;&#xFF0C;&#x4FBF;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x3002;&#x4E00;&#x4E9B;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F8B;&#x5982;&#x9664;&#x96F6;&#x9519;&#x8BEF;&#xFF0C;&#x4F1A;&#x7531;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x3002;</p>
<p>&#x5F53;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x65F6;&#xFF0C;&#x4F1A;&#x8FDB;&#x884C;&#x201C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x201D;&#xFF0C;&#x5B83;&#x5C31;&#x50CF;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x9664;&#x4E86;&#x5E76;&#x975E;&#x8DF3;&#x5230;&#x51FD;&#x6570;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x662F;&#x6267;&#x884C;&#x4E00;&#x6761;&#x7279;&#x6B8A;&#x7684;&#x6307;&#x4EE4;&#x6765;&#x89E6;&#x53D1;&#x4E2D;&#x65AD;&#xFF0C;&#x4F7F;&#x6267;&#x884C;&#x6D41;&#x8DF3;&#x5230;&#x5185;&#x6838;&#x4E2D;&#x3002;&#x5185;&#x6838;&#x8BFB;&#x53D6;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6267;&#x884C;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4E4B;&#x540E;&#x4F7F;&#x88AB;&#x4E2D;&#x65AD;&#x8FDB;&#x7A0B;&#x6062;&#x590D;&#x8FD0;&#x884C;&#x3002;</p>
<h2 id="81-&#x786C;&#x4EF6;&#x72B6;&#x6001;">8.1 &#x786C;&#x4EF6;&#x72B6;&#x6001;</h2>
<p>&#x4E2D;&#x65AD;&#x7684;&#x5904;&#x7406;&#x9700;&#x8981;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x7684;&#x914D;&#x5408;&#x3002;&#x5F53;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x65F6;&#xFF0C;CPU&#x4E0A;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x591A;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x4E5F;&#x50A8;&#x5B58;&#x7740;&#x6570;&#x636E;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x786C;&#x4EF6;&#x8D1F;&#x8D23;&#x5C06;CPU&#x8BBE;&#x4E3A;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF;&#x6761;&#x6307;&#x4EE4;&#x5E94;&#x8BE5;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x6216;&#x8005;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x51FA;&#x73B0;&#x6267;&#x884C;&#x5230;&#x4E00;&#x534A;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x786C;&#x4EF6;&#x4E5F;&#x8D1F;&#x8D23;&#x4FDD;&#x5B58;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF08;PC&#xFF09;&#xFF0C;&#x4FBF;&#x4E8E;&#x5185;&#x6838;&#x4E86;&#x89E3;&#x4ECE;&#x54EA;&#x91CC;&#x6062;&#x590D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#xFF0C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x901A;&#x5E38;&#x8D1F;&#x8D23;&#x4FDD;&#x5B58;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x5185;&#x6838;&#x9700;&#x8981;&#x6267;&#x884C;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x4F1A;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x201C;&#x786C;&#x4EF6;&#x72B6;&#x6001;&#x201D;&#x9700;&#x8981;&#x5728;&#x4FEE;&#x6539;&#x4E4B;&#x524D;&#x4FDD;&#x5B58;&#xFF0C;&#x5E76;&#x5728;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x6062;&#x590D;&#x8FD0;&#x884C;&#x540E;&#x590D;&#x539F;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x4E8B;&#x4EF6;&#x7684;&#x5927;&#x81F4;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<ol>
<li>&#x5F53;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x786C;&#x4EF6;&#x5C06;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4FDD;&#x5B58;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x8DF3;&#x5230;&#x5408;&#x9002;&#x7684;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x3002;</li>
<li>&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x5C06;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x548C;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;&#x6253;&#x7B97;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x50A8;&#x5B58;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x3002;</li>
<li>&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x8FD0;&#x884C;&#x5904;&#x7406;&#x4E2D;&#x65AD;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x3002;</li>
<li>&#x4E4B;&#x540E;&#x5B83;&#x590D;&#x539F;&#x6240;&#x4FDD;&#x5B58;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x590D;&#x539F;&#x88AB;&#x4E2D;&#x65AD;&#x8FDB;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x8FD9;&#x4F1A;&#x8DF3;&#x56DE;&#x5230;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</li>
</ol>
<p>&#x5982;&#x679C;&#x8FD9;&#x4E00;&#x673A;&#x5236;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x88AB;&#x4E2D;&#x65AD;&#x8FDB;&#x7A0B;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E2D;&#x65AD;&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x68C0;&#x6D4B;&#x5230;&#x4E86;&#x6307;&#x4EE4;&#x95F4;&#x7684;&#x5C0F;&#x53D8;&#x5316;&#x3002;</p>
<h2 id="82-&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;">8.2 &#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;</h2>
<p>&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x6574;&#x4E2A;&#x786C;&#x4EF6;&#x72B6;&#x6001;&#x3002;&#x5B83;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x6253;&#x7B97;&#x4F7F;&#x7528;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5F53;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5185;&#x6838;&#x5E76;&#x4E0D;&#x603B;&#x4F1A;&#x6062;&#x590D;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5207;&#x6362;&#x5230;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x53EB;&#x505A;&#x201C;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x201D;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x5185;&#x6838;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4F1A;&#x7528;&#x5230;&#x54EA;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5168;&#x90E8;&#x4FDD;&#x5B58;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5F53;&#x5B83;&#x5207;&#x6362;&#x5230;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6E05;&#x9664;&#x50A8;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;&#xFF08;MMU&#xFF09;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x4EE5;&#x53CA;&#x5728;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x8981;&#x82B1;&#x8D39;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x4E3A;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x5C06;&#x6570;&#x636E;&#x52A0;&#x8F7D;&#x5230;&#x7F13;&#x5B58;&#x4E2D;&#x3002; &#x51FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x76F8;&#x5BF9;&#x8F83;&#x6162;&#xFF0C;&#x5927;&#x7EA6;&#x662F;&#x51E0;&#x5343;&#x4E2A;&#x5468;&#x671F;&#x6216;&#x51E0;&#x6BEB;&#x79D2;&#x3002;</p>
<p>&#x5728;&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x5141;&#x8BB8;&#x8FD0;&#x884C;&#x4E00;&#x5C0F;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x65F6;&#x95F4;&#x7247;&#x201D;&#x6216;&#x201C;quantum&#x201D;&#x3002;&#x5728;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5185;&#x6838;&#x4F1A;&#x8BBE;&#x7F6E;&#x4E00;&#x4E9B;&#x786C;&#x4EF6;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x5728;&#x65F6;&#x95F4;&#x7247;&#x7684;&#x672B;&#x5C3E;&#x4EA7;&#x751F;&#x4E2D;&#x65AD;&#x3002;&#x5F53;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5185;&#x6838;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x6216;&#x8005;&#x5141;&#x8BB8;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x505A;&#x51B3;&#x7B56;&#x7684;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x53EB;&#x505A;&#x201C;&#x8C03;&#x5EA6;&#x5668;&#x201D;&#x3002;</p>
<h2 id="83-&#x8FDB;&#x7A0B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;">8.3 &#x8FDB;&#x7A0B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;</h2>
<p>&#x5F53;&#x8FDB;&#x7A0B;&#x88AB;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x4E3A;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x5305;&#x542B;&#x8FDB;&#x7A0B;&#x4FE1;&#x606F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x201D;&#xFF08;PCB&#xFF09;&#x3002;&#x5728;&#x5176;&#x5B83;&#x65B9;&#x9762;&#xFF0C;PCB&#x8DDF;&#x8E2A;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x8FD0;&#x884C;&#xFF08;Running&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x4E8E;&#x67D0;&#x4E2A;&#x6838;&#x5FC3;&#x4E0A;&#x3002;</li>
<li>&#x5C31;&#x7EEA;&#xFF08;Ready&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x4F46;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#xFF0C;&#x901A;&#x5E38;&#x7531;&#x4E8E;&#x5C31;&#x7EEA;&#x8FDB;&#x7A0B;&#x6570;&#x91CF;&#x5927;&#x4E8E;&#x5185;&#x6838;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
<li>&#x963B;&#x585E;&#xFF08;Blocked&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x7531;&#x4E8E;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6216;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x7EC8;&#x6B62;&#xFF08;Done&#xFF09;&#xFF1A;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x5B8C;&#x6BD5;&#xFF0C;&#x4F46;&#x662F;&#x5E26;&#x6709;&#x6CA1;&#x6709;&#x8BFB;&#x53D6;&#x7684;&#x9000;&#x51FA;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x53EF;&#x5BFC;&#x81F4;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7684;&#x4E8B;&#x4EF6;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7C7B;&#x4F3C;&#x4E8E;<code>fork</code>&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x65F6;&#x8BDE;&#x751F;&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x901A;&#x5E38;&#x5C31;&#x7EEA;&#x3002;&#x4E4B;&#x540E;&#x8C03;&#x5EA6;&#x5668;&#x53EF;&#x80FD;&#x6062;&#x590D;&#x539F;&#x6709;&#x7684;&#x8FDB;&#x7A0B;&#xFF08;&#x201C;&#x7236;&#x8FDB;&#x7A0B;&#x201D;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x542F;&#x52A8;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#xFF08;&#x201C;&#x5B50;&#x8FDB;&#x7A0B;&#x201D;&#xFF09;&#x3002;</li>
<li>&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7531;&#x8C03;&#x5EA6;&#x5668;&#x542F;&#x52A8;&#x6216;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x5C31;&#x7EEA;&#x53D8;&#x4E3A;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x88AB;&#x4E2D;&#x65AD;&#xFF0C;&#x5E76;&#x4E14;&#x8C03;&#x5EA6;&#x5668;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x4F7F;&#x5B83;&#x6062;&#x590D;&#xFF0C;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x8FD0;&#x884C;&#x53D8;&#x6210;&#x5C31;&#x7EEA;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x4E0D;&#x80FD;&#x7ACB;&#x5373;&#x5B8C;&#x6210;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x78C1;&#x76D8;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x4F1A;&#x53D8;&#x4E3A;&#x963B;&#x585E;&#xFF0C;&#x5E76;&#x4E14;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x9009;&#x62E9;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;</li>
<li>&#x5F53;&#x7C7B;&#x4F3C;&#x4E8E;&#x78C1;&#x76D8;&#x8BF7;&#x6C42;&#x7684;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x4E2D;&#x65AD;&#x3002;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x5F04;&#x6E05;&#x695A;&#x54EA;&#x4E2A;&#x8FDB;&#x7A0B;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x963B;&#x585E;&#x53D8;&#x4E3A;&#x5C31;&#x7EEA;&#x3002;</li>
<li>&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;<code>exit</code>&#x65F6;&#xFF0C;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x5728;PCB&#x4E2D;&#x50A8;&#x5B58;&#x9000;&#x51FA;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5C06;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x4E3A;&#x7EC8;&#x6B62;&#x3002;</li>
</ul>
<h2 id="84-&#x8C03;&#x5EA6;">8.4 &#x8C03;&#x5EA6;</h2>
<p>&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;2.3&#x8282;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x7740;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x6761;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x5E38;&#x5927;&#x591A;&#x6570;&#x8FDB;&#x7A0B;&#x90FD;&#x662F;&#x963B;&#x585E;&#x7684;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x8FDB;&#x7A0B;&#x662F;&#x5C31;&#x7EEA;&#x6216;&#x8005;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x5F53;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x51B3;&#x5B9A;&#x90A3;&#x4E2A;&#x8FDB;&#x7A0B;&#x5E94;&#x542F;&#x52A8;&#x6216;&#x6062;&#x590D;&#x3002;</p>
<p>&#x5728;&#x5DE5;&#x4F5C;&#x7AD9;&#x6216;&#x7B14;&#x8BB0;&#x672C;&#x4E0A;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x9996;&#x8981;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x8BE5;&#x5FEB;&#x901F;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x8C03;&#x5EA6;&#x5668;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x80FD;&#x5C1D;&#x8BD5;&#x6700;&#x5927;&#x5316;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x5B83;&#x662F;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x6240;&#x5B8C;&#x6210;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x8C03;&#x5EA6;&#x5668;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x4E8E;&#x8FDB;&#x7A0B;&#x6240;&#x505A;&#x4E8B;&#x60C5;&#x7684;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x57FA;&#x4E8E;&#x4E00;&#x4E9B;&#x542F;&#x53D1;&#x6765;&#x505A;&#x51B3;&#x7B56;&#xFF1A;</p>
<ul>
<li>&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x88AB;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x6E90;&#x9650;&#x5236;&#x3002;&#x6267;&#x884C;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#x7684;&#x8FDB;&#x7A0B;&#x662F;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E;&#x5F97;&#x5230;&#x4E86;&#x591A;&#x5C11;CPU&#x65F6;&#x95F4;&#x3002;&#x4ECE;&#x7F51;&#x7EDC;&#x6216;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x8FDB;&#x7A0B;&#x662F;IO&#x5BC6;&#x96C6;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x6570;&#x636E;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x66F4;&#x5FEB;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x66F4;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x66F4;&#x591A;CPU&#x65F6;&#x95F4;&#x4E0B;&#x5B83;&#x4E0D;&#x4F1A;&#x8FD0;&#x884C;&#x5F97;&#x66F4;&#x5FEB;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x91CC;&#x53EF;&#x80FD;&#x90FD;&#x662F;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x7528;&#x4E8E;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x7684;&#x52A8;&#x4F5C;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x5C06;&#x8FDB;&#x7A0B;&#x57FA;&#x4E8E;&#x5B83;&#x4EEC;&#x8FC7;&#x53BB;&#x7684;&#x884C;&#x4E3A;&#x5206;&#x7C7B;&#xFF0C;&#x5E76;&#x505A;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x8C03;&#x5EA6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x4EA4;&#x4E92;&#x578B;&#x8FDB;&#x7A0B;&#x4E0D;&#x518D;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x5E94;&#x8BE5;&#x9A6C;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x56DE;&#x5E94;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x7684;CPU&#x5BC6;&#x96C6;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x5C31;&#x4E0D;&#x662F;&#x65F6;&#x95F4;&#x654F;&#x611F;&#x7684;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x8FD0;&#x884C;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E4B;&#x540E;&#x53D1;&#x51FA;&#x4E86;&#x963B;&#x585E;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x5E94;&#x8BE5;&#x7ACB;&#x5373;&#x8FD0;&#x884C;&#xFF0C;&#x51FA;&#x4E8E;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;&#xFF08;1&#xFF09;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x5FEB;&#x542F;&#x52A8;&#x5B83;&#xFF0C;&#xFF08;2&#xFF09;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x5E94;&#x8BE5;&#x7B49;&#x5F85;&#x77ED;&#x65F6;&#x95F4;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53CD;&#x8FC7;&#x6765;&#x3002;&#x4F5C;&#x4E3A;&#x7C7B;&#x6BD4;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x505A;&#x82F9;&#x679C;&#x9985;&#x997C;&#x3002;&#x9762;&#x5305;&#x76AE;&#x9700;&#x8981;5&#x5206;&#x949F;&#x6765;&#x51C6;&#x5907;&#xFF0C;&#x4F46;&#x662F;&#x4E4B;&#x540E;&#x9700;&#x8981;&#x534A;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x51B7;&#x5374;&#x3002;&#x800C;&#x9985;&#x6599;&#x9700;&#x8981;20&#x5206;&#x949F;&#x6765;&#x51C6;&#x5907;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9996;&#x5148;&#x51C6;&#x5907;&#x9762;&#x5305;&#x76AE;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x51B7;&#x5374;&#x65F6;&#x51C6;&#x5907;&#x9985;&#x6599;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;35&#x5206;&#x949F;&#x4E4B;&#x5185;&#x505A;&#x5B8C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5148;&#x51C6;&#x5907;&#x9985;&#x6599;&#xFF0C;&#x5C31;&#x4F1A;&#x82B1;&#x8D39;55&#x5206;&#x949F;&#x3002;</li>
</ul>
<p>&#x5927;&#x591A;&#x6570;&#x8C03;&#x5EA6;&#x5668;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x57FA;&#x4E8E;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8C03;&#x5EA6;&#x5F62;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x6709;&#x53EF;&#x4EE5;&#x8C03;&#x4E0A;&#x6216;&#x8C03;&#x4E0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x5F53;&#x8C03;&#x5EA6;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x9009;&#x62E9;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x5C31;&#x7EEA;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x51B3;&#x5B9A;&#x8FDB;&#x7A0B;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4E00;&#x4E9B;&#x56E0;&#x7D20;&#xFF1A;</p>
<ul>
<li>&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FDB;&#x7A0B;&#x901A;&#x5E38;&#x8FD0;&#x884C;&#x8F83;&#x5FEB;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x65F6;&#x95F4;&#x7247;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x5E76;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x662F;IO&#x5BC6;&#x96C6;&#x578B;&#x7A0B;&#x5E8F;&#x6216;&#x4EA4;&#x4E92;&#x578B;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x5E94;&#x8BE5;&#x5347;&#x9AD8;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x6574;&#x4E2A;&#x65F6;&#x95F4;&#x7247;&#x4E2D;&#x90FD;&#x8FD0;&#x884C;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x662F;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x5E94;&#x8BE5;&#x964D;&#x4F4E;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x957F;&#x65F6;&#x95F4;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x4E4B;&#x540E;&#x53D8;&#x4E3A;&#x5C31;&#x7EEA;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x63D0;&#x5347;&#x4E3A;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4FBF;&#x4E8E;&#x54CD;&#x5E94;&#x6240;&#x7B49;&#x5F85;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8FDB;&#x7A0B;A&#x5728;&#x7B49;&#x5F85;&#x8FDB;&#x7A0B;B&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x7531;&#x7BA1;&#x9053;&#x8FDE;&#x63A5;&#xFF0C;&#x8FDB;&#x7A0B;B&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x5E94;&#x5347;&#x9AD8;&#x3002;</li>
<li>&#x7CFB;&#x7EDF;&#x8C03;&#x7528;<code>nice</code>&#x5141;&#x8BB8;&#x8FDB;&#x7A0B;&#x964D;&#x4F4E;&#xFF08;&#x4F46;&#x4E0D;&#x80FD;&#x5347;&#x9AD8;&#xFF09;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x5411;&#x8C03;&#x5EA6;&#x5668;&#x4F20;&#x9012;&#x663E;&#x5F0F;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x8FD0;&#x884C;&#x666E;&#x901A;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x7684;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5BF9;&#x6027;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x663E;&#x8457;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x5C31;&#x8DB3;&#x591F;&#x597D;&#x4E86;&#x3002;</p>
<h2 id="85-&#x5B9E;&#x65F6;&#x8C03;&#x5EA6;">8.5 &#x5B9E;&#x65F6;&#x8C03;&#x5EA6;</h2>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0E;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x4EA4;&#x4E92;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8C03;&#x5EA6;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;&#x4F20;&#x611F;&#x5668;&#x548C;&#x63A7;&#x5236;&#x9A6C;&#x8FBE;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4EE5;&#x6700;&#x5C0F;&#x7684;&#x9891;&#x7387;&#x5B8C;&#x6210;&#x91CD;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x4EE5;&#x6700;&#x5927;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5BF9;&#x5916;&#x754C;&#x4E8B;&#x4EF6;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#x3002;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#x901A;&#x5E38;&#x8868;&#x8FF0;&#x4E3A;&#x5FC5;&#x987B;&#x5728;&#x201C;&#x622A;&#x6B62;&#x671F;&#x9650;&#x201D;&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#x7684;&#x201C;&#x4EFB;&#x52A1;&#x201D;&#x3002;</p>
<p>&#x8C03;&#x5EA6;&#x6EE1;&#x8DB3;&#x622A;&#x6B62;&#x671F;&#x9650;&#x7684;&#x4EFB;&#x52A1;&#x53EB;&#x505A;&#x201C;&#x5B9E;&#x65F6;&#x8C03;&#x5EA6;&#x201D;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;Linux&#x7684;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x88AB;&#x4FEE;&#x6539;&#x6765;&#x5904;&#x7406;&#x5B9E;&#x65F6;&#x8C03;&#x5EA6;&#x3002;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x4E3A;&#x63A7;&#x5236;&#x4EFB;&#x52A1;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x63D0;&#x4F9B;&#x66F4;&#x4E30;&#x5BCC;&#x7684;API&#x3002;</li>
<li>&#x4FEE;&#x6539;&#x8C03;&#x5EA6;&#x5668;&#x6765;&#x786E;&#x4FDD;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FDB;&#x7A0B;&#x5728;&#x56FA;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x5668;&#x6765;&#x4FDD;&#x8BC1;&#x6700;&#x5927;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x4FEE;&#x6539;&#x9501;&#x548C;&#x5176;&#x5B83;&#x540C;&#x6B65;&#x673A;&#x5236;&#xFF08;&#x4E0B;&#x4E00;&#x7AE0;&#x4F1A;&#x8BB2;&#x5230;&#xFF09;&#xFF0C;&#x5141;&#x8BB8;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x9884;&#x5148;&#x5360;&#x7528;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x3002;</li>
<li>&#x9009;&#x62E9;&#x4FDD;&#x8BC1;&#x6700;&#x5927;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x7684;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5B9E;&#x73B0;&#x3002;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x66F4;&#x82DB;&#x523B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5B9E;&#x65F6;&#x54CD;&#x5E94;&#x662F;&#x751F;&#x6B7B;&#x6538;&#x5173;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x201C;&#x5B9E;&#x65F6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x201D;&#x63D0;&#x4F9B;&#x4E86;&#x4E13;&#x7528;&#x80FD;&#x529B;&#xFF0C;&#x901A;&#x5E38;&#x6BD4;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x62E5;&#x6709;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch7.html" class="navigation navigation-prev " aria-label="Previous page: 第七章 缓存">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch9.html" class="navigation navigation-next " aria-label="Next page: 第九章 线程">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第八章 多任务","level":"1.10","depth":1,"next":{"title":"第九章 线程","level":"1.11","depth":1,"path":"ch9.md","ref":"ch9.md","articles":[]},"previous":{"title":"第七章 缓存","level":"1.9","depth":1,"path":"ch7.md","ref":"ch7.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch8.md","mtime":"2018-01-28T13:50:43.817Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-01-28T13:55:30.349Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

